## Pandas DataFrame
- DataFrame is the most widely used data structure in Python pandas. You can imagine it as a table in a database or a spreadsheet.

- Imagine you have an automobile showroom, and you want to analyze cars’ data to make business strategies. For example, you need to check how many vehicles you have in your showroom of type sedan, or the cars that give good mileage. For such analysis pandas DataFrame is used.

## What is DataFrame in Pandas

- Dataframe is a tabular(rows, columns) representation of data. It is a two-dimensional data structure with potentially heterogeneous data.

- Dataframe is a size-mutable structure that means data can be added or deleted from it, unlike data series, which does not allow operations that change its size.

## DataFrame creation

- Data is available in various forms and types like CSV, SQL table, JSON, or Python structures like list, dict etc. We need to convert all such different data formats into a DataFrame so that we can use pandas libraries to analyze such data efficiently.

- To create DataFrame, we can use either the DataFrame constructor or pandas’ built-in functions

## DataFrame constructor

- pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

## Parameters:

- data: It takes input dict, list, set, ndarray, Iterable, or DataFrame. If the input is not provided, then it creates an empty DataFrame. The resultant column order follows the insertion order.
    
- index: (Optional) It takes the list of row index for the DataFrame. The default value is a range of integers 0, 1,…n.
    
- columns : (Optional) It takes the list of columns for the DataFrame. The default value is a range of integers 0, 1,…n.
    
- dtype : (Optional) By default, It infers the data type from the data, but this option applies any specific data type to the whole DataFrame.
    
- copy : (Optional) Copy data from inputs. Boolean, Default False. Only affects DataFrame or 2d array-like inputs.

## Dataframe from dict

- When we have data in dict or any default data structures in Python, we can convert it into DataFrame using the DataFrame constructor.

- To construct a DataFrame from a dict object, we can pass it to the DataFrame constructor pd.DataFrame(dict). It creates DataFrame using, where dict keys will be column labels, and dict values will be the columns’ data. We can also use DataFrame.from_dict() function to Create DataFrame from dict.

In [2]:
import pandas as pd
#python dict object
my_dict = {'Name': ['raju', 'klyan'], 'age': [29, 30], 'marks': [99,98]}
print(my_dict)

{'Name': ['raju', 'klyan'], 'age': [29, 30], 'marks': [99, 98]}

In [7]:
df = pd.DataFrame(my_dict)
print(df)

    Name  age  marks
0   raju   29     99
1  klyan   30     98

In [13]:
df = pd.DataFrame(my_dict, index = [11, 12], dtype = float)
print(df)

     Name   age  marks
11   raju  29.0   99.0
12  klyan  30.0   98.0

C:\Users\RAJU~1.GUL\AppData\Local\Temp/ipykernel_2072/2402174807.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(my_dict, index = [11, 12], dtype = float)

In [16]:
pwd

'E:\\RAJU'

## Dataframe from CSV

- In the field of Data Science, CSV files are used to store large datasets. To efficiently analyze such datasets, we need to convert them into pandas DataFrame.

- To create a DataFrame from CSV, we use the read_csv('file_name') function that takes the file name as input and returns DataFrame as output.

In [17]:
cars = pd.read_csv("Automobile_data.csv")

In [18]:
print(cars)

          company   body-style  length engine-type  avg-mileage
0     alfa-romero  convertible   168.8        dohc           21
1     alfa-romero    hatchback   171.2        ohcv           19
2            audi        sedan   176.6         ohc           24
3            audi        sedan   176.6         ohc           18
4            audi        sedan   177.3         ohc           19
5            audi        wagon   192.7         ohc           19
6             bmw        sedan   176.8         ohc           23
7             bmw        sedan   176.8         ohc           23
8             bmw        sedan   176.8         ohc           21
9             bmw        sedan   189.0         ohc           16
10            bmw        sedan   193.8         ohc           16
11            bmw        sedan   197.0         ohc           15
12      chevrolet    hatchback   141.1         ohc           47
13      chevrolet    hatchback   155.9         ohc           38
14      chevrolet        sedan   158.8         ohc           38
15          dodge    hatchback   157.3         ohc           31
16          dodge    hatchback   157.3         ohc           31
17          honda        wagon   157.1         ohc           30
18          honda        sedan   175.4         ohc           24
19          honda        sedan   169.1         ohc           25
20          isuzu        sedan   170.7         ohc           24
21          isuzu        sedan   155.9         ohc           38
22          isuzu        sedan   155.9         ohc           38
23         jaguar        sedan   199.6        dohc           15
24         jaguar        sedan   199.6        dohc           15
25         jaguar        sedan   191.7        ohcv           13
26          mazda    hatchback   159.1         ohc           30
27          mazda    hatchback   159.1         ohc           31
28          mazda    hatchback   159.1         ohc           31
29          mazda    hatchback   169.0       rotor           17
30          mazda        sedan   175.0         ohc           31
31  mercedes-benz        sedan   190.9         ohc           22
32  mercedes-benz        wagon   190.9         ohc           22
33  mercedes-benz        sedan   208.1        ohcv           14
34  mercedes-benz      hardtop   199.2        ohcv           14
35     mitsubishi    hatchback   157.3         ohc           37
36     mitsubishi    hatchback   157.3         ohc           31
37     mitsubishi        sedan   172.4         ohc           25
38     mitsubishi        sedan   172.4         ohc           25
39         nissan        sedan   165.3         ohc           45
40         nissan        sedan   165.3         ohc           31
41         nissan        sedan   165.3         ohc           31
42         nissan        wagon   170.2         ohc           31
43         nissan        sedan   184.6        ohcv           19
44        porsche      hardtop   168.9        ohcf           17
45        porsche  convertible   168.9        ohcf           17
46        porsche    hatchback   175.7       dohcv           17
47         toyota    hatchback   158.7         ohc           35
48         toyota    hatchback   158.7         ohc           31
49         toyota    hatchback   158.7         ohc           31
50         toyota        wagon   169.7         ohc           31
51         toyota        wagon   169.7         ohc           27
52         toyota        wagon   169.7         ohc           27
53         toyota        wagon   187.8        dohc           19
54     volkswagen        sedan   171.7         ohc           37
55     volkswagen        sedan   171.7         ohc           27
56     volkswagen        sedan   171.7         ohc           37
57     volkswagen        sedan   171.7         ohc           26
58          volvo        sedan   188.8         ohc           23
59          volvo        wagon   188.8         ohc           23

## DataFrame Options

- When DataFrame is vast, and we can not display the whole data while printing. In that case, we need to change how DataFrame gets display on the console using the print function. For that, pandas have provided many options and functions to customize the presentation of the DataFrame.

## To customize the display of DataFrame while printing
- When we display the DataFrame using print() function by default, it displays 10 rows (top 5 and bottom 5). Sometimes we may need to show more or lesser rows than the default view of the DataFrame.

- We can change the setting by using pd.options or pd.set_option() functions. Both can be used interchangeably.

In [20]:
# setting max rows to be shown
pd.options.display.max_rows = 20
print(cars)

        company   body-style  length engine-type  avg-mileage
0   alfa-romero  convertible   168.8        dohc           21
1   alfa-romero    hatchback   171.2        ohcv           19
2          audi        sedan   176.6         ohc           24
3          audi        sedan   176.6         ohc           18
4          audi        sedan   177.3         ohc           19
..          ...          ...     ...         ...          ...
55   volkswagen        sedan   171.7         ohc           27
56   volkswagen        sedan   171.7         ohc           37
57   volkswagen        sedan   171.7         ohc           26
58        volvo        sedan   188.8         ohc           23
59        volvo        wagon   188.8         ohc           23

[60 rows x 5 columns]

In [22]:
# setting minimum rows to be shown

pd.set_option('display.min_rows', 5)
print(cars)

        company   body-style  length engine-type  avg-mileage
0   alfa-romero  convertible   168.8        dohc           21
1   alfa-romero    hatchback   171.2        ohcv           19
..          ...          ...     ...         ...          ...
58        volvo        sedan   188.8         ohc           23
59        volvo        wagon   188.8         ohc           23

[60 rows x 5 columns]

## DataFrame metadata

- Sometimes we need to get metadata of the DataFrame and not the content inside it. Such metadata information is useful to understand the DataFrame as it gives more details about the DataFrame that we need to process.

- In this section, we cover the functions which provide such information of the DataFrame.

## Metadata info of DataFrame
- DataFrame.info() is a function of DataFrame that gives metadata of DataFrame. Which includes,



- Number of rows and its range of index
- Total number of columns
- List of columns
- Count of the total number of non-null values in the column
- Data type of column
- Count of columns in each data type
- Memory usage by the DataFrame

In [30]:
cars = pd.read_csv("Automobile_data.csv")
#get data frame info
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   company      60 non-null     object
 1   body-style   60 non-null     object
 2   length       60 non-null     float64
 3   engine-type  60 non-null     object
 4   avg-mileage  60 non-null     int64
dtypes: float64(1), int64(1), object(3)
memory usage: 2.5+ KB

## Get the statistics of DataFrame
- DataFrame.describe() is a function that gives mathematical statistics of the data in DataFrame. But, it applies to the columns that contain numeric values.

- In our example of student DataFrame, it gives descriptive statistics of “Age” and “Marks” columns only, that includes:

- count: Total number of non-null values in the column
- mean: an average of numbers
- std: a standard deviation value
- min: minimum value
- 25%: 25th percentile
- 50%: 50th percentile
- 75%: 75th percentile
- max: maximum value

In [31]:
# get data Frame discription
cars.describe()

           length  avg-mileage
count   60.000000    60.000000
mean   173.170000    25.883333
std     14.128914     8.174146
min    141.100000    13.000000
25%    159.100000    19.000000
50%    171.450000    25.000000
75%    179.125000    31.000000
max    208.100000    47.000000

Home » Python » Pandas » Pandas DataFrame
Pandas DataFrame
Updated on: April 5, 2021 | 1 Comment

In this lesson, you will learn pandas DataFrame. It covers the basics of DataFrame, its attributes, functions, and how to use DataFrame for Data Analysis.

DataFrame is the most widely used data structure in Python pandas. You can imagine it as a table in a database or a spreadsheet.

Imagine you have an automobile showroom, and you want to analyze cars’ data to make business strategies. For example, you need to check how many vehicles you have in your showroom of type sedan, or the cars that give good mileage. For such analysis pandas DataFrame is used.

Table of contents
What is DataFrame in Pandas
DataFrame creation
DataFrame constructor
Dataframe from dict
Dataframe from CSV
DataFrame Options
To customize the display of DataFrame while printing
DataFrame metadata
Metadata info of DataFrame
Get the statistics of DataFrame
DataFrame Attributes
Example
DataFrame selection
Example
DataFrame modification
Insert columns
Drop columns
Apply condition
DataFrame filter columns
DataFrame rename columns
DataFrame Join
DataFrame GroupBy
DataFrame Iteration
DataFrame Sorting
DataFrame conversion
Next Steps

What is DataFrame in Pandas
Dataframe is a tabular(rows, columns) representation of data. It is a two-dimensional data structure with potentially heterogeneous data.

Dataframe is a size-mutable structure that means data can be added or deleted from it, unlike data series, which does not allow operations that change its size.

Pandas DataFrame
Pandas DataFrame

DataFrame creation
Data is available in various forms and types like CSV, SQL table, JSON, or Python structures like list, dict etc. We need to convert all such different data formats into a DataFrame so that we can use pandas libraries to analyze such data efficiently.

To create DataFrame, we can use either the DataFrame constructor or pandas’ built-in functions. Below are some examples.

DataFrame constructor

pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
Parameters:

data: It takes input dict, list, set, ndarray, Iterable, or DataFrame. If the input is not provided, then it creates an empty DataFrame. The resultant column order follows the insertion order.
index: (Optional) It takes the list of row index for the DataFrame. The default value is a range of integers 0, 1,…n.
columns : (Optional) It takes the list of columns for the DataFrame. The default value is a range of integers 0, 1,…n.
dtype : (Optional) By default, It infers the data type from the data, but this option applies any specific data type to the whole DataFrame.
copy : (Optional) Copy data from inputs. Boolean, Default False. Only affects DataFrame or 2d array-like inputs

Refer the following articles for more details:

Create pandas DataFrame from Python List
Create pandas DataFrame from Python Dictionary
Dataframe from dict
When we have data in dict or any default data structures in Python, we can convert it into DataFrame using the DataFrame constructor.

To construct a DataFrame from a dict object, we can pass it to the DataFrame constructor pd.DataFrame(dict). It creates DataFrame using, where dict keys will be column labels, and dict values will be the columns’ data. We can also use DataFrame.from_dict() function to Create DataFrame from dict.


Example

Dictionary

student_dict = {'Name':['Joe','Nat'], 'Age':[20,21], 'Marks':[85.10, 77.80]}
‘Name‘, ‘Age‘ and ‘Marks‘ are the keys in the dict when you convert they will become the column labels of the DataFrame.

import pandas as pd

# Python dict object
student_dict = {'Name': ['Joe', 'Nat'], 'Age': [20, 21], 'Marks': [85.10, 77.80]}
print(student_dict)

# Create DataFrame from dict
student_df = pd.DataFrame(student_dict)
print(student_df)
 Run
Output

{'Name': ['Joe', 'Nat'], 'Age': [20, 21], 'Marks': [85.1, 77.8]}

  Name  Age  Marks
0  Joe   20   85.1
1  Nat   21   77.8
Dataframe from CSV
In the field of Data Science, CSV files are used to store large datasets. To efficiently analyze such datasets, we need to convert them into pandas DataFrame.

To create a DataFrame from CSV, we use the read_csv('file_name') function that takes the file name as input and returns DataFrame as output.

Let’s see how to read the Automobile_data.csv file into the DataFrame.

Automobile Dataset CSV File
‘Automobile_data.csv’ Dataset
cars = pd.read_csv("Automobile_data.csv")
print(cars)
Output

        company   body-style  length engine-type  avg-mileage
0   alfa-romero  convertible   168.8        dohc           21
1   alfa-romero    hatchback   171.2        ohcv           19
2          audi        sedan   176.6         ohc           24
..          ...          ...     ...         ...          ...
58        volvo        sedan   188.8         ohc           23
59        volvo        wagon   188.8         ohc           23
DataFrame Options
When DataFrame is vast, and we can not display the whole data while printing. In that case, we need to change how DataFrame gets display on the console using the print function. For that, pandas have provided many options and functions to customize the presentation of the DataFrame.

To customize the display of DataFrame while printing
When we display the DataFrame using print() function by default, it displays 10 rows (top 5 and bottom 5). Sometimes we may need to show more or lesser rows than the default view of the DataFrame.

We can change the setting by using pd.options or pd.set_option() functions. Both can be used interchangeably.

The below example will show a maximum of 20 and a minimum of 5 rows while printing DataFrame.

import pandas as pd

# Setting maximum rows to be shown 
pd.options.display.max_rows = 20

# Setting minimum rows to be shown
pd.set_option("display.min_rows", 5)

# Print DataFrame
print(cars)
Output

        company   body-style  length engine-type  avg-mileage
0   alfa-romero  convertible   168.8        dohc           21
1   alfa-romero    hatchback   171.2        ohcv           19
..          ...          ...     ...         ...          ...
58        volvo        sedan   188.8         ohc           23
59        volvo        wagon   188.8         ohc           23

[60 rows x 5 columns]
DataFrame metadata
Sometimes we need to get metadata of the DataFrame and not the content inside it. Such metadata information is useful to understand the DataFrame as it gives more details about the DataFrame that we need to process.

In this section, we cover the functions which provide such information of the DataFrame.

Let’s take an example of student DataFrame which contains ‘Name‘, ‘Age‘ and ‘Marks‘ of students as shown below.

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54

Metadata info of DataFrame
DataFrame.info() is a function of DataFrame that gives metadata of DataFrame. Which includes,

Number of rows and its range of index
Total number of columns
List of columns
Count of the total number of non-null values in the column
Data type of column
Count of columns in each data type
Memory usage by the DataFrame

Example

In the below example, we got metadata information of student DataFrame.

# get dataframe info
student_df.info()
Output

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype  
---  ------  --------------  -----  
 0   Name    3 non-null      object 
 1   Age     3 non-null      int64  
 2   Marks   3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

Get the statistics of DataFrame
DataFrame.describe() is a function that gives mathematical statistics of the data in DataFrame. But, it applies to the columns that contain numeric values.

In our example of student DataFrame, it gives descriptive statistics of “Age” and “Marks” columns only, that includes:

count: Total number of non-null values in the column
mean: an average of numbers
std: a standard deviation value
min: minimum value
25%: 25th percentile
50%: 50th percentile
75%: 75th percentile
max: maximum value

Note: Output of  DataFrame.describe() function varies depending on the input DataFrame.

Example

# get dataframe description
student_df.describe()
Output

        Age      Marks
count   3.0   3.000000
mean   20.0  84.813333
std     1.0   6.874484
min    19.0  77.800000
25%    19.5  81.450000
50%    20.0  85.100000
75%    20.5  88.320000
max    21.0  91.540000

## DataFrame Attributes
- DataFrame has provided many built-in attributes. Attributes do not modify the underlying data, unlike functions, but it is used to get more details about the DataFrame.

- Following are majorly used attributes of the DataFrame.

## Attribute	Description
1.DataFrame.index:	It gives the Range of the row index

2.DataFrame.columns:	It gives a list of column labels

3.DataFrame.dtypes:	It gives column names and their data type

4.DataFrame.values:	It gives all the rows in DataFrame

5.DataFrame.empty:	It is used to check if the DataFrame is empty

6.DataFrame.size:	It gives a total number of values in DataFrame

7.DataFrame.shape:	It a number of rows and columns in DataFrame
                     pandas DataFrame Attributes

In [35]:
import pandas as pd
#create data frame from dict
my_dict = { 'name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 29, 7], 'marks': [99, 98, 100]}
df = pd.DataFrame(my_dict)
print("Data Frame:\n", df)

Data Frame:
      name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [36]:
print('Data Frame Columns:\n', df.columns)

Data Frame Columns:
 Index(['name', 'Age', 'marks'], dtype='object')

In [38]:
print('Data Frame Column type:\n', df.dtypes)

Data Frame Column type:
 name     object
Age       int64
marks     int64
dtype: object

In [39]:
print('Data Frame is empty:\n', df.empty)

Data Frame is empty:
 False

In [40]:
print('Data Frame Shape:\n', df.shape)

Data Frame Shape:
 (3, 3)

In [41]:
print('Data Frame size:\n', df.size)

Data Frame size:
 9

In [42]:
print('Data Frame values:\n', df.values)

Data Frame values:
 [['raju' 30 99]
 ['kalyan' 29 98]
 ['sunny' 7 100]]

## DataFrame selection
- While dealing with the vast data in DataFrame, a data analyst always needs to select a particular row or column for the analysis. In such cases, functions that can choose a set of rows or columns like top rows, bottom rows, or data within an index range play a significant role.

- Following are the functions that help in selecting the subset of the DataFrame.

## Function	Description
1.DataFrame.head(n)	: It is used to select top ‘n’ rows in DataFrame.

2.DataFrame.tail(n):	It is used to select bottom ‘n’ rows in DataFrame.

3.DataFrame.at:	It is used to get and set the particular value of DataFrame using row and column labels.

4.DataFrame.iat:	It is used to get and set the particular value of DataFrame using row and column index positions.

5.DataFrame.get(key):	It is used to get the value of a key in DataFrame where Key is the column name.

6.DataFrame.loc():	It is used to select a group of data based on the row and column labels. It is used for slicing and filtering of the DataFrame.

7.DataFrame.iloc():	It is used to select a group of data based on the row and column index position. Use it for slicing and filtering the DataFrame. pandas function for selecting data from DataFrame

In [44]:
import pandas as pd
#create data frame from dict
my_dict = { 'name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 29, 7], 'marks': [99, 98, 100]}
df = pd.DataFrame(my_dict)
print("Data Frame:\n", df)

Data Frame:
      name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [45]:
#select top 2 rows
df.head(2)

     name  Age  marks
0    raju   30     99
1  kalyan   29     98

In [46]:
#select bottom 2 rows
df.tail(2)

     name  Age  marks
1  kalyan   29     98
2   sunny    7    100

In [49]:
#select values at row index and column name
print(df.at[0, 'name'])
print(df.at[1, 'name'])
print(df.at[1, 'Age'])

raju
kalyan
29

In [53]:
#select value at 1st row and 1st index
print(df.iat[0,0])
print(df.iat[0,1])
print(df.iat[1,1])
print(df.iat[1,0])

raju
30
29
kalyan

In [54]:
#select the values of name column
print(df.get('name'))

0      raju
1    kalyan
2     sunny
Name: name, dtype: object

In [56]:
print(df.get('Age'))

0    30
1    29
2     7
Name: Age, dtype: int64

In [57]:
# Select values from row index 0 t0 2 and 'name' column
print(df.loc[0:2, ['name']])

     name
0    raju
1  kalyan
2   sunny

In [58]:
print(df.loc[0:2])

     name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [60]:
print(df.loc[0:1])

     name  Age  marks
0    raju   30     99
1  kalyan   29     98

In [62]:
print(df.loc[0:2, ['name', 'marks']])

     name  marks
0    raju     99
1  kalyan     98
2   sunny    100

In [65]:
df1 = df.loc[0:2, ['name', 'marks']]
print(df1)

     name  marks
0    raju     99
1  kalyan     98
2   sunny    100

In [66]:
# select row index 0 to2(exclusive) and column position 0 t0 2(exclusive)
print(df.iloc[0:2, 0:2])

     name  Age
0    raju   30
1  kalyan   29

In [71]:
print(df.iloc[0])

name     raju
Age        30
marks      99
Name: 0, dtype: object

In [75]:
print(df.iloc[0:3])

     name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [73]:
print(df.iloc[0:2])

     name  Age  marks
0    raju   30     99
1  kalyan   29     98

In [76]:
print(df.iloc[:])

     name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [78]:
print(df.iloc[:0:3])

Empty DataFrame
Columns: [name, Age, marks]
Index: []

## DataFrame modification
- DataFrame is similar to any excel sheet or a database table where we need to insert new data or drop columns and rows if not required. Such data manipulation operations are very common on a DataFrame.

## Insert columns
- Sometimes it is required to add a new column in the DataFrame. DataFrame.insert() function is used to insert a new column in DataFrame at the specified position.

- In the below example, we insert a new column “Class” as a third new column in the DataFrame with default value ‘A’ using the syntax:

- df.insert(loc = col_position, column = new_col_name, value = default_value)

In [86]:
import pandas as pd
#create data frame from dict
my_dict = { 'name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 29, 7], 'marks': [99, 98, 100]}
df1 = pd.DataFrame(my_dict)
print("Data Frame:\n", df1)

Data Frame:
      name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [87]:
print(df1)

     name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [90]:
#insert new column in Data Frame and display

df1.insert(loc = 2, column = "Class", value = "A")
print(df1)

     name  Age Class  marks
0    raju   30     A     99
1  kalyan   29     A     98
2   sunny    7     A    100

## Drop columns
- DataFrame may contain redundant data, in such cases, we may need to delete such data that is not required. DataFrame.drop() function is used to delete the columns from DataFrame.

- In the below example, we delete the “Age” column from the student DataFrame using  df.drop(columns=[col1,col2...]).

In [92]:
import pandas as pd
#create data frame from dict
my_dict = { 'name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 29, 7], 'marks': [99, 98, 100]}
df2 = pd.DataFrame(my_dict)
print("Data Frame:\n", df2)

Data Frame:
      name  Age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7    100

In [93]:
df2 = df2.drop(columns = 'Age')

In [94]:
df2

     name  marks
0    raju     99
1  kalyan     98
2   sunny    100

In [95]:
df2 = df2.drop(columns = ['name', 'marks'])

In [96]:
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [97]:
df1

     name  Age Class  marks
0    raju   30     A     99
1  kalyan   29     A     98
2   sunny    7     A    100

## Apply condition
- We may need to update the value in the DataFrame based on some condition. DataFrame.where() function is used to replace the value of DataFrame, where the condition is False.

- where(filter, other=new_value)
## It applies the filter condition on all the rows in the DataFrame, as follows:

- If the filter condition returns False, then it updates the row with the value specified in other parameter.

- If the filter condition returns True, then it does not update the row.

## Example

- In the below example, we want to replace the student marks with ‘0’ where marks are less than 95. We pass a filter condition df['Marks'] > 80 to the function.

In [99]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 31, 7], 'marks': [99, 94, 98]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  marks
0    raju   30     99
1  kalyan   31     94
2   sunny    7     98

In [101]:
#define filter
filter = df["marks"] > 95
df['marks'].where(filter, other = 0, inplace = True)
print(df)

     Name  Age  marks
0    raju   30     99
1  kalyan   31      0
2   sunny    7     98

## DataFrame filter columns
- Datasets contain massive data that need to be analyzed. But, sometimes, we may want to analyze relevant data and filter out all the other data. In such a case, we can use DataFrame.filter() function to fetch only required data from DataFrame.

- It returns the subset of the DataFrame by applying conditions on each row index or column label as specified using the below syntax.

## df.filter(like = filter_cond, axis = 'columns' or 'index')

- It applies the condition on each row index or column label.

- If the condition passed then, it includes that row or column in the resultant DataFrame.
- If the condition failed, then it does not have that row or column in the resulting DataFrame.
- Note: It applies the filter on row index or column label, not on actual data.

In [113]:
#Example
my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 31, 7], 'marks': [99, 94, 98]}
df = pd.DataFrame(my_dict)
print(df)
#In the below example, we only include the column with a column label that starts with ‘N’.

#applying filter on Data Frame
df = df.filter(like = 'N', axis = 'columns')
print(df)

     Name  Age  marks
0    raju   30     99
1  kalyan   31     94
2   sunny    7     98
     Name
0    raju
1  kalyan
2   sunny

## DataFrame rename columns
- While working with DataFrame, we may need to rename the column or row index. We can use DataFrame.rename() function to alter the row or column labels.

- We need to pass a dictionary of key-value pairs as input to the function. Where key of the dict is the existing column label, and the value of dict is the new column label.

- df.rename(columns = {'old':'new'})

- It can be used to rename single or multiple columns and row labels.

## Example

- In the below example, we rename column ‘Marks‘ to ‘Percentage‘ in the student DataFrame.

In [118]:
#Example
my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'Age': [30, 31, 7], 'Marks': [99, 94, 98]}
df = pd.DataFrame(my_dict)
print(df)

#rename column

df = df.rename(columns = {'Marks': 'Percentage'})
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   31     94
2   sunny    7     98
     Name  Age  Percentage
0    raju   30          99
1  kalyan   31          94
2   sunny    7          98

In [119]:
df

     Name  Age  Percentage
0    raju   30          99
1  kalyan   31          94
2   sunny    7          98

In [120]:
#rename column

df = df.rename(columns = {'Name': 'Names', "Age": 'age'})
print(df)

    Names  age  Percentage
0    raju   30          99
1  kalyan   31          94
2   sunny    7          98

## DataFrame Join
- In most of the use cases of Data Analytics, data gathered from multiple sources, and we need to combine that data for further analysis. In such instances, join and merge operations are required.

- DataFrame.join() function is used to join one DataFrame with another DataFrame as df1.join(df2)

In [121]:
import pandas as pd
#create data frame from dict
my_dict1 = {'Name': ['raju', 'kalyan'], 'age': [30, 29]}
df1 = pd.DataFrame(my_dict1)
print(df1)

     Name  age
0    raju   30
1  kalyan   29

In [123]:
my_dict2 = {'marks': [99, 98]}
df2 = pd.DataFrame(my_dict2)
print(df2)

   marks
0     99
1     98

In [124]:
#joining 2 data frames
df3 = df1.join(df2)

In [125]:
df3

     Name  age  marks
0    raju   30     99
1  kalyan   29     98

## DataFrame GroupBy
- GroupBy operation means splitting the data and then combining them based on some condition. Large data can be divided into logical groups to analyze it.

- DataFrame.groupby() function groups the DataFrame row-wise or column-wise based on the condition.

## Example

- If we want to analyze each class’s average marks, we need to combine the student data based on the ‘Class’ column and calculate its average using df.groupby(col_label).mean() as shown in the below example.

In [132]:
#create a data frame from dict

my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'class': ['A', 'B', 'A'], 'marks': [99, 97, 98]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age class  marks
0    raju   30     A     99
1  kalyan   29     B     97
2   sunny    7     A     98

In [133]:
df1 = df

In [134]:
#apply group by
df1 = df1.groupby('class').mean()
print(df1)

        age  marks
class
A      18.5   98.5
B      29.0   97.0

## DataFrame Iteration
- DataFrame iteration means visiting each element in the DataFrame one by one. While analyzing a DataFrame, we may need to iterate over each row of the DataFrame.

- There are multiple ways to iterate a DataFrame. We will see the function DataFrame.iterrows(), which can loop a DataFrame row-wise. It returns the index and row of the DataFrame in each iteration of the for a loop.

In [138]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'class': ['A', 'B', 'A'], 'marks': [99, 97, 98]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age class  marks
0    raju   30     A     99
1  kalyan   29     B     97
2   sunny    7     A     98

In [139]:
for index, row in df.iterrows():
    print(index, row)

0 Name     raju
age        30
class       A
marks      99
Name: 0, dtype: object
1 Name     kalyan
age          29
class         B
marks        97
Name: 1, dtype: object
2 Name     sunny
age          7
class        A
marks       98
Name: 2, dtype: object

## DataFrame Sorting

- Data Analyst always needs to perform different operations on the underlying data like merge, sort, concatenate, etc. The most frequently used operation is the sorting of data. Sorted data becomes easy to analyze and inferred.

- The DataFrame.sort_values() function is used to sort the DataFrame using one or more columns in ascending (default) or descending order.

In [140]:
#Example

# In the below example, we sort the student data based on the ‘Marks‘.

my_dict = {'Name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'class': ['A', 'B', 'A'], 'marks': [99, 97, 98]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age class  marks
0    raju   30     A     99
1  kalyan   29     B     97
2   sunny    7     A     98

In [141]:
df = df.sort_values(by = ['marks'])
print(df)

     Name  age class  marks
1  kalyan   29     B     97
2   sunny    7     A     98
0    raju   30     A     99

In [142]:
df = df.sort_values(by = ['age'])
print(df)

     Name  age class  marks
2   sunny    7     A     98
1  kalyan   29     B     97
0    raju   30     A     99

## DataFrame conversion
- After all the processing on DataFrame, we will get the expected data in the DataFrame. But, we may require to convert the DataFrame back to its original formats like CSV file or dict, or we may need to convert it to another format for further action like storing it into the Database as SQL table format.

- Pandas have provided plenty of functions to convert the DataFrames into many different formats.

- For example, DataFrame.to_dict() function is used to converts the DataFrame into a Python dictionary object.

In [144]:
# Let’s see how we can use DataFrame.to_dict() function to convert the DataFrame into the Python dictionary. By default, it creates the dictionary with keys as column labels and values as mapping of the row index and data.
print(df)

     Name  age class  marks
2   sunny    7     A     98
1  kalyan   29     B     97
0    raju   30     A     99

In [145]:
#convert data frame to dict

dict2 = df.to_dict()
print(dict2)

{'Name': {2: 'sunny', 1: 'kalyan', 0: 'raju'}, 'age': {2: 7, 1: 29, 0: 30}, 'class': {2: 'A', 1: 'B', 0: 'A'}, 'marks': {2: 98, 1: 97, 0: 99}}

## Create Pandas DataFrame from Python dictionary

- Python dictionary is the data structure that stores the data in key-value pairs. By converting data from dictionary format to DataFrame will make it very competent for analysis by using functions of DataFrame.

- There are multiple ways to convert Python dictionary object into Pandas DataFrame. Majorly used ways are,
1.DataFrame constructor

2. from_dict()

## Create DataFrame from dict using constructor

- DataFrame constructor can be used to create DataFrame from different data structures in python like dict, list, set, tuple, and ndarray.

- When you convert a dict to DataFrame by default,  all the keys of the dict object becomes columns, and the range of numbers 0, 1, 2,…,n is assigned as a row index.

In [148]:
import pandas as pd

#create data frame with dict

my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98, 97]}

df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

## DataFrame from dict with required columns only
- While converting the whole dict to DataFrame, we may need only some of the columns to be included in the resulting DataFrame.

- We can select only required columns by passing list column labels to columns=['col1', 'col2'] parameter in the constructor.

In [149]:
#Example

#In the case of student DataFrame for analyzing the annual score, we need only “student name” and “marks” whereas the “age” 
#column is not required. We can select only required columns, as shown in the below example.

my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98, 97]}

df = pd.DataFrame(my_dict, columns = ['name', 'marks'])
print(df)

     name  marks
0    raju     99
1  kalyan     98
2   sunny     97

## DataFrame from dict with user-defined indexes
- In pandas DataFrame, each row has an index that is used to identify each row. In some cases, we need to provide a customized index for each row. We can do that while creating the DataFrame from dict using the index parameter of the DataFrame constructor.

- The default index is a range of integers starting from 0 to a number of rows. We can pass a list of the row indexes as index=['index1','index2'] to the dataFrame constructor.

In [150]:
#Example

#In the below example, we have given a customer index for each student, making it more readable and easy to access the 
#row using it.
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98, 97]}

df = pd.DataFrame(my_dict, index = ['stud1', 'stud2', 'stud3'])
print(df)

         name  age  marks
stud1    raju   30     99
stud2  kalyan   29     98
stud3   sunny    7     97

## DataFrame from dict by changing the column data type

- By default, while creating a DataFrame from dict using constructor, it keeps the original data type of the values in dict. But, if we need to change the data type of the data in the resulting DataFrame, we can use the dtype parameter in the constructor.

- Only one data type is allowed to specify as dtype='data_type' which will be applicable for all the data in the resultant DataFrame. If we do not force such a data type, it internally infers from the Data.

- Note: It changes the data type only if it is compatible with the new data type. Otherwise, it keeps the original data type.

In [152]:

my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98, 97]}

df = pd.DataFrame(my_dict)
print('Data Frame with inferred data type:\n', df.dtypes)

Data Frame with inferred data type:
 name     object
age       int64
marks     int64
dtype: object

In [153]:
df = pd.DataFrame(my_dict, dtype = 'float64')
print('data frame with changed data type', df.dtypes)

data frame with changed data type name      object
age      float64
marks    float64
dtype: object

C:\Users\RAJU~1.GUL\AppData\Local\Temp/ipykernel_2072/312180822.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  df = pd.DataFrame(my_dict, dtype = 'float64')

## DataFrame from dict with a single value
- If we have a dict with only single values for each key and need to convert such dict to the DataFrame, we can use the DataFrame constructor.

- In such a case, it converts the dict to DataFrame as we have seen before, like keys of the dict will be column labels and values will be the column data. But, we must provide the index parameter to give the row index. Else it throws an error,

- ValueError: If using all scalar values, you must pass an index

In [156]:
#In the below example, we have provided the customized index=['stud1'] to the DataFrame.

my_dict = {'name': 'raju', 'age': 30, 'marks': 100}
df = pd.DataFrame(my_dict, index = ['stud1'])
print(df)

       name  age  marks
stud1  raju   30    100

## DataFrame from dict with key and value as a column
- Suppose we have a dictionary object where the key is the student’s name, and the value is the student’s marks. And we want the keys in one column and all the values in another column of the DataFrame.

- For that, rather than passing a whole dict object, we need to pass each key-value pair in the dictionary to the DataFrame constructor to create a new DataFrame.

- We can get the entry of key-value pair using dict.items() and pass that function to the constructor.

In [160]:
#Example

# As shown in the below example, we need to pass an entry of key-value to the constructor and give column labels using columns parameter.

# create dict object

my_dict = {'raju': 99, 'kalyan': 97, 'sunny': 100}

#create data frame from dict

df = pd.DataFrame(my_dict.items(), columns = ['name11', 'marks22'])
print(df)

   name11  marks22
0    raju       99
1  kalyan       97
2   sunny      100

## Create DataFrame from list of dict

- For the sake of our understanding, consider the case where each school stores data of students into the dictionary data structure. Each school store different information about students. Like, some school stores student’s hobby whereas some school only stores academic information. If we want to analyze data of all the students from the city, we need to gather all this information into the DataFrame.

- To convert such a list of dict from different schools can be converted to a single DataFrame using either DataFrame.from_dict() function or DataFrame constructor.

- By default, keys of all the different dictionary objects are converted into columns of resultant DataFrame. It handles the missing keys by adding NaN where the values for the column are missing.

In [161]:
#Let’s see how we can use a constructor to create DataFrame from different dictionary objects.
import pandas as pd
#create a dict object
my_dict = [{'name': 'raju', 'age': 30, 'marks': '99', 'hobby': 'reading'}, {'name': 'kalyan', 'age': 29, 'marks': 98}, 
           {'name': 'sunny', 'age': 7, 'marks': 97}]
df = pd.DataFrame(my_dict)
print(df)

     name  age marks    hobby
0    raju   30    99  reading
1  kalyan   29    98      NaN
2   sunny    7    97      NaN

## The from_dict() function
- This is another way of creating DataFrame from a Python dictionary using DataFrame.from_dict() method.

- Note: This method is useful for the cases when you need to transpose the DataFrame i.e. when we need the keys in the dictionary object as rows in the resultant DataFrame. In all the other cases DataFrame constructor should be preferred.
    
- DataFrame.from_dict(data, orient='columns', dtype=None, columns=None)

- 1.data: It takes dict, list, set, ndarray, Iterable, or DataFrame as input. An empty DataFrame will be created if it is not provided. The resultant column order follows the insertion order.
- 2.orient: (Optional) If the keys of the dict should be the rows of the DataFrame, then set orient = index else set it to column (Default) if the keys should be columns of the resultant DataFrame.
- 3.dtype : (Optional) data type to force on resulting DataFrame. Only a single data type is allowed. If not given, then it’s inferred from the data.
- 4.columns : (Optional) Only be used in case of orient="index" to specify column labels in the resulting DataFrame. Default column labels are range of integer i.e. 0,1,2…n. Note: If we use the columns parameter with orient='columns' it throws an ValueError: cannot use columns parameter with orient='columns'

## DataFrame from dict with dict keys as a row
- It is used to transpose the DataFrame, i.e., when keys in the dictionary should be the rows in the resultant DataFrame. We can change the orientation of the DataFrame using a parameter orient="index" in DataFrame.from_dict().

- Example

- In the below example, keys “name“, “age“, and “marks” becomes row indexes in the DataFrame, and values are added in respective rows. New column labels are provided using columns parameter.

In [170]:
my_dict ={'name': ['raju', 'kalyan', 'sunny'], 'age': [30, 29, 7], 'marks': [99,98, 97]}
#df = pd.DataFrame(my_dict)
df22 = pd.DataFrame.from_dict(my_dict,  orient='index', columns=['stud1', 'stud2', 'stud3'])
print(df22)

      stud1   stud2  stud3
name   raju  kalyan  sunny
age      30      29      7
marks    99      98     97

## DataFrame from dict where values are variable-length lists
- It is a widespread use case in the IT industry where data is stored in the dictionary with different values against each key.

- If such a dictionary object needs to be converted into the DataFrame such that keys and values will be added as columns in DataFrame. Then it can be done using chaining of DataFrame.from_dict(), stack(), and reset_index() functions.

- Example

- Here, we have dict with values are of different sizes and still we need to add all the key-values into a DataFrame.

In [172]:
my_dict = {'Grade A': ['raju', 'klayn'], 'Grade B': ['vinny']}

df = pd.DataFrame.from_dict(my_dict, 'index').stack().reset_index(level = 0)
print(df)

   level_0      0
0  Grade A   raju
1  Grade A  klayn
0  Grade B  vinny

## DataFrame from dict nested dict
- In this section, we cover the complex structure of the dictionary object where we have a hierarchical structure of the dictionary i.e. one dictionary object into another dictionary object.

- In the below example, we have a student dictionary object where student data categorized by their grades and further divided as per their class. Such a dictionary object is converted into the multi-index DataFrame using DataFrame.from_dict() by iterating over each key and its values and parameter orient='index'.

In [176]:
#create  hierarchical dict

my_dict = {'Grade A': {'Class A': {'name': 'raju', 'marks': 99},
                       'Class B': {'name': 'klayan', 'marks': 98}}, 
                                                                            
        'Grade B': {'Class A': {'name': 'sunny', 'marks': 97}, 
                    'Class B': {'name': 'vinny', 'marks': 95}}}

In [178]:
#create multi index data frame

df = pd.DataFrame.from_dict({(i, j): my_dict[i][j]
                            for i in my_dict.keys()
                            for j in my_dict[i].keys()}, orient = 'index')

In [179]:
print(df)

                   name  marks
Grade A Class A    raju     99
        Class B  klayan     98
Grade B Class A   sunny     97
        Class B   vinny     95

## Create Pandas DataFrame from Python List

- The List is a simple data structure in Python that stores the values as a List. The List can have heterogeneous elements, i.e., it can have values of different types. To analyze such a List, we can convert it into the pandas DataFrame. By converting the List into a 2-dimensional structure makes it efficient to process.

## Create DataFrame from list using constructor

- DataFrame constructor can create DataFrame from different data structures in python like dict, list, set, tuple, and ndarray.

- In the below example, we create a DataFrame object using a list of heterogeneous data. By default, all list elements are added as a row in the DataFrame. And row index is the range of numbers(starting at 0).

In [180]:
import pandas as pd

lst = ['raju', 99, 'kalyan', 100]
df = pd.DataFrame(lst)
print(df)

        0
0    raju
1      99
2  kalyan
3     100

## Create DataFrame from list with a customized column name
- While creating a DataFrame from the list, we can give a customized column label in the resultant DataFrame. By default, it provides a range of integers as column labels, i.e., 0, 1, 2…n.

- We can specify column labels into the columns=[col_labels] parameter in the DataFrame constructor.

In [181]:
#In the below example, we create DataFrame from a list of fruit names and provides a column label as “Fruits”.

lst = ['apple','banana', 'orange', 'mango']
df = pd.DataFrame(lst, columns = ['Fruits'])
print(df)

   Fruits
0   apple
1  banana
2  orange
3   mango

## Create DataFrame from list with a customized index

- As we just discussed the changing column label, we can even customize the row index as well. We can give a meaningful row index to identify each row uniquely. It becomes easier to access the rows using the index label.

- We can specify row index into the index=[row_index1, row_index2] parameter in the DataFrame constructor. By default, it gives a range of integers as row index i.e. 0, 1, 2…n.

In [182]:
lst = ['apple','banana', 'orange', 'mango']

df = pd.DataFrame(lst, index = ['Fruit1', 'Fruit2', 'Fruit3', 'Fruit4'])
print(df)

             0
Fruit1   apple
Fruit2  banana
Fruit3  orange
Fruit4   mango

In [184]:
df = pd.DataFrame(lst, index = ['Fruit1', 'Fruit2', 'Fruit3', 'Fruit4'], columns = ['Name_Fruits'])
print(df)

       Name_Fruits
Fruit1       apple
Fruit2      banana
Fruit3      orange
Fruit4       mango

## Create DataFrame from list by changing data type

- While converting a Python List to the DataFrame, we may need to change the values’ data type.

- We can change the data type of the list elements using the dtype parameter of the DataFrame constructor.

- Example

- Suppose we have a list of fruit’s prices of type object. But, while creating DataFrame we need to correct its data type to float64. In such case we use dtype parameter as shown below example.

In [188]:
price_list = [20,30,40,50]
#create data frame from list
df = pd.DataFrame(price_list)
print('data type before', df.dtypes)
df1 = pd.DataFrame(price_list, dtype = 'float64')
print('data type after', df1.dtypes)

data type before 0    int64
dtype: object
data type after 0    float64
dtype: object

## Create DataFrame from hierarchical lists as rows
- It may be possible to have data scattered into multiple lists or in the list of lists, also called a multi-dimensional list. In such a case, We can pass such a list to the DataFrame constructor to convert it into the DataFrame. By default, it adds each list as a row in the resultant DataFrame.

- Example

- In the below example, we have a list that has lists of fruit names and their prices. DataFrame constructor will add both the lists as a separate row in the resulting DataFrame.

In [190]:
fruits_list = [['apple', 'banana', 'orange', 'mango'], [100, 40, 80, 70]]
df = pd.DataFrame(fruits_list)
print(df)

       0       1       2      3
0  apple  banana  orange  mango
1    100      40      80     70

## Create DataFrame from Hierarchical lists as columns
- As discussed in the above section, we have a multi-dimensional list, but we do not want them to add to the DataFrame as a row. Instead, we want to add each list as a separate column in the DataFrame. For that, we need to use the transpose() function.

- In the below example, we have a list of two lists, fruit names and another for the fruits’ price. And we want to add both the list as a separate column in the DataFrame.

In [192]:
fruits_list = [['apple', 'banana', 'orange', 'mango'], [100, 40, 80, 70]]

df = pd.DataFrame(fruits_list).transpose()
print(df)

        0    1
0   apple  100
1  banana   40
2  orange   80
3   mango   70

## Create DataFrame from multiple lists
- It is the most common use case in the industry where you have multiple separate lists, and you need to add them as different columns in the DataFrame. This case can be resolved by following two ways:

- using zip(list1, list2...)
- using dict { 'col1' : list1, 'col2' : list2}

- Example

- The below example demonstrates the use of zip() function to combine multiple lists in one list and pass it to the DataFrame constructor.

In [193]:
#create multiplelists
fruit_list = ['apple', 'banana', 'orange', 'mango']
price_list = [100, 40, 80, 70]
df = pd.DataFrame(list(zip(fruit_list, price_list)), columns = ['Name', 'Price'])
print(df)

     Name  Price
0   apple    100
1  banana     40
2  orange     80
3   mango     70

In [195]:
# The below example demonstrates the use of Python dictionary data structure to solve the purpose. 
#Here, column names are keys of the dict and, lists are the values of dict which need to be added in the DataFrame.

fruit_list = ['apple', 'banana', 'orange', 'mango']
price_list = [100, 40, 80, 70]

my_dict = {'Name': fruit_list, 
          'Price': price_list}
df = pd.DataFrame(my_dict)
print(df)

     Name  Price
0   apple    100
1  banana     40
2  orange     80
3   mango     70

## Pandas DataFrame head, tail, at, iat

## How to use DataFrame.head() function
- This function is used to see the first n rows in the DataFrame. It is beneficial when we have massive datasets, and it is not possible to see the entire dataset at once.

- It takes input as the number of rows to be displayed from the top. The default value is 5.

- Syntax

- DataFrame.head(n=5)

In [196]:
student_dict = {'name':['raju', 'kalyan', 'rajukalyan', 'sunny', 'bunny', 'vinny', 'kanna'],
               'Age': [17,18, 19, 20, 21, 22, 23],
               'Marks': [99,98,97, 95, 94, 97, 98]}

In [198]:
import pandas as pd
df = pd.DataFrame(student_dict)
#display 1st 5 rows
df.head()

         name  Age  Marks
0        raju   17     99
1      kalyan   18     98
2  rajukalyan   19     97
3       sunny   20     95
4       bunny   21     94

## Select top n rows in pandas DataFrame
- When we want to see a smaller section of data, we can use the function DataFrame.head() and pass a parameter as the number of rows to display from the top.

In [199]:
#display 1st 2 rows
df.head(n=2)

     name  Age  Marks
0    raju   17     99
1  kalyan   18     98

## Select top rows except for last n rows
- When we have a vast DataFrame, and we want to see all the rows except for the last n rows, we can pass the negative value as a parameter to DataFrame.head().

In [200]:
df.head(n = -2) #remove last 2 rows

         name  Age  Marks
0        raju   17     99
1      kalyan   18     98
2  rajukalyan   19     97
3       sunny   20     95
4       bunny   21     94

## Select top rows from multi-index DataFrames
- When Python pandas DataFrame has multiple row index or column headers, then are called multi-level or hierarchical DataFrame. As we have discussed in the above section, we can use the DataFrame.head() function on multi-index DataFrames to display the top rows.

- The below diagram shows hierarchical DataFrame of Student data with two-column headers where column labels ‘Name‘ and ‘Marks‘ are at level 0 and ‘Surname‘ and ‘Percentage‘ at level 1. Similarly, two-row indexes are index ‘Standard‘ at level 0 and ‘Class‘ at level 1 of the DataFrame.

In [ ]:
#https://pynative.com/pandas-dataframe-head-tail-at-iat/

In [ ]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'), ('Standard 1', 'Class B'),
                                   ('Standard 2', 'Class A'), ('Standard 2', 'Class B'),
                                   ('Standard 3', 'Class A'), ('Standard 3', 'Class B')],
                                  names=['Standard', 'Class'])

columns = pd.MultiIndex.from_tuples([('Name', 'Surname'),
('Marks', 'Percentage')])

# create multi-index dataframe
student_df = pd.DataFrame([('Joe', 91.56), ('Nat', 87.90),('Harry', 70.10), 
                           ('Sam', 65.48), ("Jill", 72), ("Jane", 80)],
                          index=index, columns=columns)

topRows = student_df.head()
print(topRows)

In [203]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'), ('Standard 1', 'Class B'),
                                  ('Standard 2', 'Class A'),('Standard 2', 'Class B'),
                                  ('Standard 3', 'Class A'),('Standard 3', 'Class B')],
                                 names = ['Standard', 'Class'])
columns = pd.MultiIndex.from_tuples([('Name', 'Surname'), 
                                   ('Marks', 'Percentage')])

In [206]:
#Create multi-index dataframe
df = pd.DataFrame([('raju', 99), ('kalyan', 98), ('sunny', 97),('vinny', 95), ('pinny', 94), ('bunny', 93)], 
                  index = index, columns = columns)
print(df)

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A    raju         99
           Class B  kalyan         98
Standard 2 Class A   sunny         97
           Class B   vinny         95
Standard 3 Class A   pinny         94
           Class B   bunny         93

In [207]:
df.head()

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A    raju         99
           Class B  kalyan         98
Standard 2 Class A   sunny         97
           Class B   vinny         95
Standard 3 Class A   pinny         94

## How to use DataFrame.tail() function

- We can use the DataFrame.tail() function to display the last n rows of the DataFrame. Like the head function, this function is used when we want to view a smaller section of the entire DataFrame.

- It takes input as the number of rows to be displayed from the bottom. The default value is 5.

- Syntax

- DataFrame.tail(n=5)

In [209]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [210]:
#display bottom 5 rows

df.tail()

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

## Select bottom n rows in pandas DataFrame
- When we want to see a smaller section of data from the bottom of the DataFrame, we can use the function DataFrame.tail() and pass a parameter as the number of rows to display from the bottom.

In [212]:
df.tail(3)

    Name  Age  Marks
2  sunny    7     97
3  bunny   40     95
4  vinny   50     94

In [211]:
df.tail(n=2)

    Name  Age  Marks
3  bunny   40     95
4  vinny   50     94

## Select bottom rows except for first n rows
- When we want to see our entire dataset except for the first few rows, we can use DataFrame.tail() function and pass the negative value as a parameter to it.

In [213]:
df.tail(-2)

    Name  Age  Marks
2  sunny    7     97
3  bunny   40     95
4  vinny   50     94

## Select bottom rows from the multi index DataFrame
- We can apply the DataFrame.tail() function on multi-index DataFrames as well. It works in the same way as normal DataFrames.

In [214]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'), ('Standard 1', 'Class B'),
                                  ('Standard 2', 'Class A'),('Standard 2', 'Class B'),
                                  ('Standard 3', 'Class A'),('Standard 3', 'Class B')],
                                 names = ['Standard', 'Class'])
columns = pd.MultiIndex.from_tuples([('Name', 'Surname'), 
                                   ('Marks', 'Percentage')])

In [215]:
#Create multi-index dataframe
df = pd.DataFrame([('raju', 99), ('kalyan', 98), ('sunny', 97),('vinny', 95), ('pinny', 94), ('bunny', 93)], 
                  index = index, columns = columns)
print(df)

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A    raju         99
           Class B  kalyan         98
Standard 2 Class A   sunny         97
           Class B   vinny         95
Standard 3 Class A   pinny         94
           Class B   bunny         93

In [216]:
df.tail()

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class B  kalyan         98
Standard 2 Class A   sunny         97
           Class B   vinny         95
Standard 3 Class A   pinny         94
           Class B   bunny         93

## Select value using row and column labels using DataFrame.at

- There are cases in the field of Data Science that we need to access a specific element of the DataFrame using its column label and row index. In such cases, we can use the DataFrame.at property and pass the row index and column labels of the value to access as parameters. This property can be used with Multi-index DataFrame as well.

- Note: It throws KeyError if the label does not exist in DataFrame.

In [217]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [218]:
df.at[2,"Age"]

7

In [219]:
df.at[3, 'Marks']

95

## Set specific value in pandas DataFrame
- When we want to update the value of the particular element from DataFrame based on its column label and row index, we can use DataFrame.at property.

In [220]:
df.at[2,"Age"] = 10

In [221]:
df

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny   10     97
3   bunny   40     95
4   vinny   50     94

## Select value using row and column position using DataFrame.iat
- We want to access a specific element from a very large DataFrame, but we do not know its column label or row index. We can still access such an element using its column and row positions. For that, we can use DataFrame.iat property of python pandas. Unlike DataFrame.at it can work on the row and column index position of the DataFrame.

- Note: Index positions starts at 0.

In [222]:
df.iat[1,2]

98

In [223]:
df.iat[1,0]

'kalyan'

## Set specific value in pandas DataFrame
- When we want to update the value of the particular element from DataFrame based on its column and row position, we can use DataFrame.iat property.

In [225]:
# change value

df.iat[1,1] = 25

In [226]:
df

     Name  Age  Marks
0    raju   30     99
1  kalyan   25     98
2   sunny   10     97
3   bunny   40     95
4   vinny   50     94

## Drop columns in pandas DataFrame


- Datasets could be in any shape and form. To optimize the data analysis, we need to remove some data that is redundant or not required. This article aims to discuss all the cases of dropping single or multiple columns from a pandas DataFrame.

- The following functions are discussed in this article in detail:

- df.drop(columns = ['col1','col2'...])
- df.pop('col_name')
- del df['col_name']

## The DataFrame.drop() function
- We can use this pandas function to remove the columns or rows from simple as well as multi-index DataFrame.
- DataFrame.drop(labels=None, axis=1, columns=None, level=None, inplace=False, errors='raise')

## Parameters:

- 1.labels: It takes a list of column labels to drop.
- 2.axis: It specifies to drop columns or rows. set a axis to 1 or ‘columns’ to drop columns. By default, it drops the rows from DataFrame.
- 3.columns: It is an alternative to axis='columns'. It takes a single column label or list of column labels as input.
- 4.level: It is used in the case of a MultiIndex DataFrame to specify the level from which the labels should be removed. It takes a level position or level name as input.
- 5.inplace: It is used to specify whether to return a new DataFrame or update an existing one. It is a boolean flag with default False.
- 6.errors: It is used to suppress KeyError error if a column is not present. It takes the following inputs:
      ‘ignore‘: It suppresses the error and drops only existing labels.
       ‘raise‘: Throws the errors if the column does not exist. It is the default case.
       
## Returns:

- It returns the DataFrame with dropped columns or None if inplace=True
- It also raises KeyError if labels are not found.

## Drop single column
- We may need to delete a single or specific column from a DataFrame.

- In the below example we drop the ‘age‘ column from the DataFrame using df.drop(columns = 'col_name')

In [227]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [228]:
# drop column

df1 = df.drop(columns = 'Age')

In [229]:
df1

     Name  Marks
0    raju     99
1  kalyan     98
2   sunny     97
3   bunny     95
4   vinny     94

## Drop multiple columns

- Use any of the following two parameters of DataFrame.drop() to delete multiple columns of DataFrame at once.

- Use the column parameter and pass the list of column names you want to remove.
- Set the axis=1 and pass the list of column names.

In [232]:
df2 = df.drop(columns = ['Age', 'Marks'])
print(df2)

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

## Using drop with axis='columns' or axis=1
- Let’s see how to drop using the axis-style convention. This is a new approach. ( This approach makes this method match the rest of the pandas API).

- Use the axis parameter of a DataFrame.drop() to delete columns. The axis can be a row or column. The column axis represented as 1 or ‘columns’.

- Set axis=1 or axis='columns' and pass the list of column names you want to remove.

In [234]:
df3 = df.drop(columns= ["Age", "Marks"], axis = 'columns')
print(df3)

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

In [235]:
df4 = df.drop(columns = ['Age', "Marks"], axis = 1)
print(df4)

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

## Drop column in place
- In the above examples, whenever we executed drop operations, pandas created a new copy of DataFrame because the modification is not in place.

- Parameter inplace is used to indicate if drop column from the existing DataFrame or create a copy of it.

- If the inplace=True then it updates the existing DataFrame and does not return anything.
- If the inplace=False then it creates a new DataFrame with updated changes and returns it.

- Note: Set inplace=True when we are doing function chaining to avoid assigning the result back to a variable as we are performing modifications in place.

In [239]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [237]:
df.drop(columns = ["Age", "Marks"], inplace = True)#it will change in same data frame

In [238]:
df

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

In [ ]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

In [240]:
df.drop(columns = ["Age", "Marks"], inplace = False) # it will return another data frame

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

In [241]:
df

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

## Drop column by suppressing errors
- By default, The DataFrame.drop()  throws KeyError if the column you are trying to delete does not exist in the dataset.

- If we want to drop the column only if exists then we can suppress the error by using the parameter errors.

- Set errors='ignore' to not throw any errors.
- Set errors='raised' to throw KeyError for the unknown columns

In [242]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [244]:
#supres error

df11 = df.drop(columns = 'salary', errors = 'ignore') # no change in df

In [245]:
df11

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [246]:
df22 = df.drop(columns = 'salary', errors = 'raised')

KeyError: "['salary'] not found in axis"

## Drop column by index position
- If there is a case where we want to drop columns in the DataFrame, but we do not know the name of the columns still we can delete the column using its index position.

- Note: Column index starts from 0 (zero) and it goes till the last column whose index value will be len(df.columns)-1 .

## Drop the last column
- Assume you want to drop the first column or the last column of the DataFrame without using the column name.

- In such cases, use the DataFrame.columns attribute to delete a column of the DataFrame based on its index position. Simply pass df.columns[index] to the columns parameter of the DataFrame.drop().

## Example

- In the below example, we are dropping the last column of the DataFrame using  df.columns[last_index].

In [247]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [248]:
#find the position of last column and drop

pos = len(df.columns)-1

In [249]:
pos

2

In [251]:
df44 = df.drop(columns = df.columns[pos])

In [252]:
df44

     Name  Age
0    raju   30
1  kalyan   29
2   sunny    7
3   bunny   40
4   vinny   50

In [253]:
df

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [254]:
#delete column present at index 1

df.drop(columns = df.columns[1])

     Name  Marks
0    raju     99
1  kalyan     98
2   sunny     97
3   bunny     95
4   vinny     94

In [255]:
df.drop(columns = df.columns[2])

     Name  Age
0    raju   30
1  kalyan   29
2   sunny    7
3   bunny   40
4   vinny   50

## Drop range of columns using iloc
- There could be a case when we need to delete the fourth column from the dataset or need to delete a range of columns. We can use DataFrame.iloc to select single or multiple columns from the DataFrame.

- We can use DataFrame.iloc in the columns parameter to specify the index position of the columns which need to drop.

In [256]:
#Example

#Let’s see how we can drop the range of the columns based on the index position. In the below example, we are dropping columns from index position 1 to 3 (exclusive).

my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97
3   bunny   40     95
4   vinny   50     94

In [257]:
df.columns.values

array(['Name', 'Age', 'Marks'], dtype=object)

In [258]:
#drop column from 1 to 3

df1 = df.drop(columns = df.iloc[:, 1:3])

In [259]:
df1

     Name
0    raju
1  kalyan
2   sunny
3   bunny
4   vinny

In [262]:
df1.columns.values

array(['Name'], dtype=object)

## Drop first n columns
- If we need to delete the first ‘n’ columns from a DataFrame, we can use DataFrame.iloc and the Python range() function to specify the columns’ range to be deleted.

- We need to use the built-in function range() with columns parameter of DataFrame.drop().

In [274]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'bunny', 'vinny'],
          "Age": [30,29,7, 40, 50],
          "Marks": [99, 98, 97, 95, 94],
          'class': ["A", 'A', 'A', 'A', 'A'],
         'city': ['hyd', 'hyd', 'hyd', 'hyd', 'hyd']}
df44 = pd.DataFrame(my_dict)
print(df44)

     Name  Age  Marks class city
0    raju   30     99     A  hyd
1  kalyan   29     98     A  hyd
2   sunny    7     97     A  hyd
3   bunny   40     95     A  hyd
4   vinny   50     94     A  hyd

In [275]:
df44.columns.values

array(['Name', 'Age', 'Marks', 'class', 'city'], dtype=object)

In [281]:
#drop column 1 and 2

df2 = df44.drop(columns = df44.iloc[:, range(2)])
print(df2)

   Marks class city
0     99     A  hyd
1     98     A  hyd
2     97     A  hyd
3     95     A  hyd
4     94     A  hyd

In [282]:
df2.columns.values

array(['Marks', 'class', 'city'], dtype=object)

## Drop column from multi-index DataFrame
- DataFrame can have multiple column headers, such DataFrame is called a multi-index DataFrame. Such headers are divided into the levels where the first header is at level 0, the second header is at level 1, and so on.

- We can drop a column from any level of multi-index DataFrame. By default, it drops columns from all the levels, but we can use a parameter level to drop from a particular level only.

- We need to pass a level name or level index as level=level_index.

In [284]:
# drop column
student_df = student_df.drop(columns=['Marks'], level=1)
print(student_df)

  Class A Class B
     Name    Name
0     Joe     Nat
1   Harry     Sam

In [285]:
#create a column header

col = pd.MultiIndex.from_arrays([['Class A', 'Class A', 'Class B', 'Class B'], ['Name', 'Marks', 'Name', 'Marks']])

In [286]:
#create a data frame from 2d array
df = pd.DataFrame([['raju', '99', 'kalyan', '98'], ['sunny', '97', 'bunny', '95']], columns = col)
print(df)

  Class A       Class B
     Name Marks    Name Marks
0    raju    99  kalyan    98
1   sunny    97   bunny    95

In [288]:
#drop column
df9 = df.drop(columns = ['Marks'], level = 1)

In [289]:
df9

  Class A Class B
     Name    Name
0    raju  kalyan
1   sunny   bunny

## Drop column using a function
- We can also use the function to delete columns by applying some logic or based on some condition. We can use built-in as well as user-defined functions to drop columns.

- Drop all the columns using loc
- If we want to drop all the columns from DataFrame we can easily do that using DataFrame.loc in the columns parameter of DataFrame.drop().

- DataFrame.loc is used to specify the column labels which need to delete.  If we do not specify any column labels like df.loc[:] then it will drop all the columns in the DataFrame.

In [291]:
my_dict = {'name': ['raju', 'kalyan'], 'age': [30,29], 'marks': [99,98]}
df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30     99
1  kalyan   29     98

In [293]:
df7 = df.drop(columns = df.loc[:])
print(df7)

Empty DataFrame
Columns: []
Index: [0, 1]

## Drop column using pandas DataFrame.pop() function
- If we want to delete a single column then we can also do that using DataFrame.pop(col_label) function. We need to pass a column label that needs to delete.

- It removes the column in-place by updating the existing DataFrame. It raises KeyError if the column is not found.

- Note: It can be used to drop a column only. It cannot drop multiple columns or row(s).

In [294]:
my_dict = {'name': ['raju', 'kalyan'], 'age': [30,29], 'marks': [99,98]}
df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30     99
1  kalyan   29     98

In [298]:
#drop column
df.pop('age')

In [300]:
df

     name  marks
0    raju     99
1  kalyan     98

## Drop column using pandas DataFrame delete
- We can also use the pandas inbuilt function del to drop a single column from a DataFrame. It is a very simplified way of dropping the column from a DataFrame.

- We need to select the column of DataFrame which needs to be deleted and pass it as  del df[col_label].

- Note: It can be used to drop a column only. It cannot drop multiple columns or row(s).

In [301]:
my_dict = {'name': ['raju', 'kalyan'], 'age': [30,29], 'marks': [99,98]}
df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30     99
1  kalyan   29     98

In [302]:
#drop column

del df['age']

In [303]:
df

     name  marks
0    raju     99
1  kalyan     98

Compare DataFrame drop() vs. pop() vs. del

Features	                  drop()	pop()	del

Operates on axis	    columns and rows	only column	only column

Delete multiple columns	  Yes	No	No

Drop in-place or return a copy	Both	Only in-place	Only in-place

Performance	                  Fast	Slow	Slow

## Drop duplicates in pandas DataFrame

- Data is gathered from various sources. It may not be in the proper form. It contains garbage values and duplicate data. Before analyzing a dataset, it must be clean and precise.

The DataFrame.drop_duplicates() function

## DataFrame.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)

## Parameters:

- subset: By default, if the rows have the same values in all the columns, they are considered duplicates. This parameter is used to specify the columns that only need to be considered for identifying duplicates.
- keep: Determines which duplicates (if any) to keep. It takes inputs as,
   -    first – Drop duplicates except for the first occurrence. This is the default behavior.
   -    last – Drop duplicates except for the last occurrence.
   -    False – Drop all duplicates.
- inplace: It is used to specify whether to return a new DataFrame or update an existing one. It is a boolean flag with default False.
- ignore_index: It is a boolean flag to indicate if row index should be reset after dropping duplicate rows. False: It keeps the original row index. True: It reset the index, and the resulting rows will be labeled 0, 1, …, n – 1.

## Returns:

- It returns the DataFrame with dropped duplicates or None if inplace=True


## Drop duplicates but keep first
- When we have the DataFrame with many duplicate rows that we want to remove we use DataFrame.drop_duplicates().

- The rows that contain the same values in all the columns then are identified as duplicates. If the row is duplicated then by default DataFrame.drop_duplicates() keeps the first occurrence of that row and drops all other duplicates of it.

In [315]:
my_dict = {'Name': ['raju', 'kalyan', 'raju', 'kalyan', 'sunny'], 'age': [30, 29, 30, 29, 7],
          'marks': [99,97,99,97,94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age  marks
0    raju   30     99
1  kalyan   29     97
2    raju   30     99
3  kalyan   29     97
4   sunny    7     94

In [316]:
#drop dublicate rows

df = df.drop_duplicates()

In [317]:
df

     Name  age  marks
0    raju   30     99
1  kalyan   29     97
4   sunny    7     94

## Drop duplicates from defined columns
- By default, DataFrame.drop_duplicate() removes rows with the same values in all the columns. But, we can modify this behavior using a subset parameter.

- For example, subset=[col1, col2] will remove the duplicate rows with the same values in specified columns only, i.e., col1 and col2.

In [318]:
my_dict = {'Name': ['raju', 'kalyan', 'raju2', 'kalyan2', 'sunny'], 'age': [30, 29, 30, 29, 7],
          'marks': [99,98,99,97,94]}
df = pd.DataFrame(my_dict)
print(df)

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
2    raju2   30     99
3  kalyan2   29     97
4    sunny    7     94

In [320]:
df = df.drop_duplicates(subset = ['age', 'marks'])
print(df)

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
3  kalyan2   29     97
4    sunny    7     94

## Drop duplicates but keep last
- Let’s consider the case where we have a row that is duplicated multiple times in the DataSet. In such a case, To keep only one occurrence of the duplicate row, we can use the keep parameter of a DataFrame.drop_duplicate(), which takes the following inputs:

- first – Drop duplicates except for the first occurrence of the duplicate row. This is the default behavior.
- last – Drop duplicates except for the last occurrence of the duplicate row.
- False – Drop all the rows which are duplicate.

In [321]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'kalyan2', 'raju'], 'age': [30, 29, 7, 29, 30],
          'marks': [99,98,94,97,99]}
df = pd.DataFrame(my_dict)
print(df)

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97
4     raju   30     99

In [322]:
df = df.drop_duplicates(keep = 'last')

In [323]:
df

      Name  age  marks
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97
4     raju   30     99

In [324]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'kalyan2', 'raju'], 'age': [30, 29, 7, 29, 30],
          'marks': [99,98,94,97,99]}
df = pd.DataFrame(my_dict)
print(df)

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97
4     raju   30     99

In [325]:
df = df.drop_duplicates(keep = 'first') #keeping first dup

In [326]:
df

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97

## Drop all duplicates

- As explained in the above section, by default, DataFrame.drop_duplicates() keeps the duplicate row’s first occurrence and removes all others.

In [327]:
my_dict = {'Name': ['raju', 'kalyan', 'sunny', 'kalyan2', 'raju'], 'age': [30, 29, 7, 29, 30],
          'marks': [99,98,94,97,99]}
df = pd.DataFrame(my_dict)
print(df)

      Name  age  marks
0     raju   30     99
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97
4     raju   30     99

In [329]:
df = df.drop_duplicates(keep = False)#all duplicates dropped

In [330]:
df

      Name  age  marks
1   kalyan   29     98
2    sunny    7     94
3  kalyan2   29     97

## Drop duplicates in place

- By default, DataFrame.drop_duplicates() removes the duplicates and returns the copy of the DataFrame.

- But, if we want to make changes in the existing DataFrame, then set the flag inplace=True. It can be used when the drop operation is part of the function chaining.

In [333]:
my_dict = {'Name': ['raju', 'kalyan', 'raju', 'kalyan', 'sunny'], 'age': [30, 29, 30, 29, 7],
          'marks': [99,97,99,97,94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age  marks
0    raju   30     99
1  kalyan   29     97
2    raju   30     99
3  kalyan   29     97
4   sunny    7     94

In [334]:
#drop duplicates rows

df.drop_duplicates(inplace = True)

In [335]:
df

     Name  age  marks
0    raju   30     99
1  kalyan   29     97
4   sunny    7     94

## Drop duplicates and reset the index
- When we drop the rows from DataFrame, by default, it keeps the original row index as is. But, if we need to reset the index of the resultant DataFrame, we can do that using the ignore_index parameter of DataFrame.drop_duplicate().

- If ignore_index=True, it reset the row labels of resultant DataFrame to 0, 1, …, n – 1.
- If ignore_index=False it does not change the original row index. By default, it is False.

In [336]:
my_dict = {'Name': ['raju', 'kalyan', 'raju', 'kalyan', 'sunny'], 'age': [30, 29, 30, 29, 7],
          'marks': [99,97,99,97,94]}
df = pd.DataFrame(my_dict)
print(df)

     Name  age  marks
0    raju   30     99
1  kalyan   29     97
2    raju   30     99
3  kalyan   29     97
4   sunny    7     94

In [337]:
#drop duplicate rows

df1 = df.drop_duplicates(keep= False, ignore_index=True)

In [338]:
df1

    Name  age  marks
0  sunny    7     94

## Drop columns with NA in pandas DataFrame

- For multiple reasons, it could happen that data in the Dataset is missing or not available. It is a very usual case where we need to clean the data before start analyzing it.

## The DataFrame.dropna() function.

- We can use this pandas function to remove columns from the DataFrame with values Not Available(NA).


## Parameters:

- axis: It determines the axis to remove. Set it to 1 or column to remove columns containing missing values. By default, it removes rows with NA from DataFrame.
- how: It takes the following inputs:
    - ‘any’: This is the default case to drop the column if it has at least one value missing.
     - ‘all’: Drop the column only if it has all the values as NA.
- thresh: It applies a condition to drop the columns only if it does not contain the required number of values. It takes an int as input.
- subset: While dropping columns, it is used to specify the list of rows to be considered to find NA.
- inplace: It is used to specify whether to return a new DataFrame or update an existing one. It is a boolean flag with default False.

## Returns:

- It returns the DataFrame with dropped NA or None if inplace=True

## Drop column where at least one value is missing
- There is a case when we cannot process the dataset with missing values. If we need to drop such columns that contain NA, we can use the axis=columns parameter of DataFrame.dropna() to specify deleting the columns.

- By default, it removes the column where one or more values are missing.

In [340]:
import numpy as np
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98, np.nan]}

df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30   99.0
1  kalyan   29   98.0
2   sunny    7    NaN

In [342]:
# drop column with NaN
df1 = df.dropna(axis = 'columns')

In [343]:
df1 # removed marks column

     name  age
0    raju   30
1  kalyan   29
2   sunny    7

## Drop column where all values are missing
- We can drop an empty column from DataFrame using DataFrame.dropna().

- We need to use how parameter as follows:

- If how='all', it drops the column where all the values are NA.
- By default, how='any', it removes the columns where one or more values are NA.

In [344]:
import numpy as np
my_dict = {'name': ['raju', np.nan, 'sunny'], 'age': [np.nan,np.nan, np.nan], 'marks': [99,98, np.nan]}

df = pd.DataFrame(my_dict)
print(df)

    name  age  marks
0   raju  NaN   99.0
1    NaN  NaN   98.0
2  sunny  NaN    NaN

In [345]:
df1 = df.dropna(axis = 1, how = 'all')#axis = columns
df1

    name  marks
0   raju   99.0
1    NaN   98.0
2  sunny    NaN

## Drop column with the number of NA
- While cleaning the dataset, we can keep the columns with at least some data available in it else drop otherwise.

- We need to use the parameter thresh=no_of_nonNA_values of DataFrame.drop() to specify the number of values that must be available in the column. Else, drop the column.

In [351]:
#In the below example, we keep the column where at least three or more values are available and drop the column if the condition is not met.

import numpy as np
my_dict = {'name': ['raju', np.nan, 'sunny', 'kalyan'], 'age': [np.nan,np.nan, np.nan, np.nan], 'marks': [99,np.nan, np.nan, 100]}

df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju  NaN   99.0
1     NaN  NaN    NaN
2   sunny  NaN    NaN
3  kalyan  NaN  100.0

In [353]:
# keep column with 3 or more non-NA values

df1 = df.dropna(axis = 1, thresh=3)
df1

     name
0    raju
1     NaN
2   sunny
3  kalyan

In [354]:
df2 = df.dropna(axis = 1, thresh = 2)
df2

     name  marks
0    raju   99.0
1     NaN    NaN
2   sunny    NaN
3  kalyan  100.0

## Drop NA from defined rows
- Suppose we are interested in dropping the column only if it contains null values in some particular rows. For example, consider when we need to drop a column if it does not have data in its initial rows.

- In such a case, we can use subset=[row1, row2] of DataFrame.dropna() to specify the list of row indexes so that it drops the columns containing missing values in these rows only, i.e., row1 and row2 in this case.

In [360]:
# Let’s see how to delete a column only if it contains the empty value in row 0 or 2, otherwise do not delete the column.

import numpy as np
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [np.nan,np.nan, np.nan], 'marks': [99,98, np.nan]}

df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju  NaN   99.0
1  kalyan  NaN   98.0
2   sunny  NaN    NaN

In [361]:
#drop marks column with NaN

df22 = df.dropna(axis = 'columns', subset = [0,1])
df22

     name  marks
0    raju   99.0
1  kalyan   98.0
2   sunny    NaN

## Drop column with missing values in place
- We can drop columns from the existing DataFrame or by creating a copy of it. For that, we can use a flag inplace of DataFrame.dropna().

- If the inplace=True, then it updates the DataFrame and returns None.
- If inplace=False, it returns the updated copy of the DataFrame.

In [362]:
#As shown in the below example, we are dropping the column from the existing DataFrame without reassigning it to a new variable.

import numpy as np
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98, np.nan]}

df = pd.DataFrame(my_dict)
print(df)

     name  age  marks
0    raju   30   99.0
1  kalyan   29   98.0
2   sunny    7    NaN

In [363]:
df.dropna(inplace = True)

In [364]:
df

     name  age  marks
0    raju   30   99.0
1  kalyan   29   98.0

## Rename columns in Pandas DataFrame

## The DataFrame.rename() function
- This is the most widely used pandas function for renaming columns and row indexes. Let’s see the syntax of it before moving to examples.

- DataFrame.rename(mapper=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='ignore')

## Parameters:

- mapper: It is used to specify new names for columns. It takes a Python dictionary or function as input.
- columns: It is used to specify new names for columns. It takes to dictionary or function as input.
- axis: Alternative to columns. It is used to specify the axis to apply with the mapper. Column axis represented as 1 or ‘columns‘. Default 0.
- copy: It allows the copy of underlying data. It is a boolean flag with default True.
- inplace: It is used to specify whether to return a new copy of a DataFrame or update existing ones. It is a boolean flag with default False.
- level: In the case of a multi-index DataFrame, only rename labels in the specified level. It takes int or level name as input. The default value is None.
- errors: It is either ‘ignore’ or ‘raise’. Default is ‘ignore’. If ‘raise’, raise a KeyError if the columns or index are not present. If ‘ignore’, existing keys will be renamed and extra keys will be ignored.


## Return value:

- It returns a DataFrame with the renamed column and row labels or None if inplace=True.
- Also, It raises KeyError If any of the labels are not found in the selected axis when errors='raise'

## Rename a single column
- Sometimes it is required to rename the single or specific column names only.  Use the column parameter of DataFrame.rename() function and pass the columns to be renamed.

- df.rename(columns={'column_current_name': 'new_name'})

In [366]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [367]:
df = df.rename(columns = {'marks': 'percentage'})
print(df)

     name  age  percentage
0    raju   30          99
1  kalyan   29          98
2   sunny    7          97

## Rename multiple columns

- Use any of the following two parameters of a DataFrame.rename() to rename multiple or all column labels at once.

- Use the column parameter and pass all column names you want to rename as a dictionary (old column name as a key and new column name as a value).
- Set the axis=1 and pass column names you want to rename as a dictionary

In [368]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [369]:
df = df.rename(columns = {'name': 'a', 'age': 'b','marks': 'c'})
df

        a   b   c
0    raju  30  99
1  kalyan  29  98
2   sunny   7  97

In [370]:
df.columns.values

array(['a', 'b', 'c'], dtype=object)

## Using rename with axis='columns' or axis=1

- Use the axis parameter of a df.rename() to rename columns and row index. The axis can be a row or column. The column axis represented as 1 or ‘columns’.

- Set axis=1 and pass column names you want to rename as a dictionary (Key-Value pairs).

In [371]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [373]:
df1 = df.rename({'name': 'a', 'age': 'b','marks': 'c'}, axis = 1)
df1

        a   b   c
0    raju  30  99
1  kalyan  29  98
2   sunny   7  97

In [374]:
df2 = df.rename({'name': 'a', 'age': 'b','marks': 'c'}, axis = 'columns')
df2

        a   b   c
0    raju  30  99
1  kalyan  29  98
2   sunny   7  97

## Rename columns in place
- In the above examples, whenever we executed rename operations, pandas created a new copy of DataFrame because the modification is not-in place.

- Specify inplace=True to rename the existing DataFrame rather than creating a copy of it.

- If the inplace=True then it updates the existing DataFrame and does not return anything.
- If the inplace=False then it creates a new DataFrame with updated changes and returns it.

- Note: You don’t need to assign the result back to a variable as we are performing modifications in place.

In [375]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [378]:
df.rename(columns = {'name': 'a'}, inplace = True)
df
df.columns.values

array(['a', 'age', 'marks'], dtype=object)

## Rename column using a function
- We can also use the function to rename column labels by applying some logic to it. We can use built-in as well as user-defined functions to rename columns.

In [379]:
#In the below example, we rename all column names to UPPER CASE using the string function str.upper.

my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [381]:
df.rename(columns = str.upper, inplace = True)
df

     NAME  AGE  MARKS
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [383]:
df.rename(columns = str.capitalize, inplace = True)
df

     Name  Age  Marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [384]:
df.columns.values

array(['Name', 'Age', 'Marks'], dtype=object)

In [385]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

## Use lambda expressions to rename
- Also, you can use lambda expressions to rename column label or row index. Let’s see how to remove the first character from each column label using lambda.

In [386]:
my_dict = {'#name': ['raju', 'kalyan', 'sunny'], '#age': [30,29,7], '#marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

    #name  #age  #marks
0    raju    30      99
1  kalyan    29      98
2   sunny     7      97

In [387]:
df.columns

Index(['#name', '#age', '#marks'], dtype='object')

In [388]:
#remove 1st cha of col

df.rename(columns = lambda x:x[1:], inplace = True)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

## Rename columns by removing leading and trailing spaces
- Use lambda expression to rename columns by removing leading and trailing spaces from the column names

In [392]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [393]:
df.columns.values

array([' name', ' age ', ' marks'], dtype=object)

In [396]:
df.rename(lambda x:x.strip(), axis = 1, inplace = True)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [397]:
df.columns.values

array(['name', 'age', 'marks'], dtype=object)

## Rename all columns with a list
- Suppose we have a list of column names that we need to use to rename the existing DataFrame. In that case, we can pass the list of column labels to a DataFrame.columns  attributes as shown in the below example.

- It will replace the existing names with the new names in the order you provide.

In [398]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [399]:
#rename column with list

df.columns = ['a', 'b', 'c']
df

        a   b   c
0    raju  30  99
1  kalyan  29  98
2   sunny   7  97

## Rename column by index position
- If there is a case where we want to rename the first column or the last column in the DataFrame, but we do not know the column name still we can rename the column using a DataFrame.columns attribute.

- Note: Column index starts from 0 (zero) and it goes till the last column whose index value will be len(df.columns)-1 .

In [400]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [401]:
print('df.columns[2],', df.columns[2])

df.columns[2],  marks

In [402]:
#rename column present at index 2

df.rename(columns = {df.columns[2]:'percentage'}, inplace = True)
df

     name   age   percentage
0    raju     30          99
1  kalyan     29          98
2   sunny      7          97

In [403]:
print('df.columns[2],', df.columns[2])

df.columns[2], percentage

In [404]:
#rename multiple columns using index

df.rename(columns = {df.columns[0]:'abc', df.columns[1]:'xyz'}, inplace = True)
df

      abc  xyz  percentage
0    raju   30          99
1  kalyan   29          98
2   sunny    7          97

## Raise error while renaming a column
- By default, The DataFrame.rename() doesn’t throw any error if column names you tried to rename doesn’t exist in the dataset.

- Do you want to throw an error in such cases?

- If yes, then use the errors parameter of DataFrame.rename().

- Set errors='raised' to throws KeyError for the unknown columns
- Set errors='ignore' to not throw any errors.
## Note:

- If the new name mapping is not provided for some column label then it isn’t renamed.
- Extra labels in the mapping don’t throw an error.

In [405]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [406]:
df.rename(columns = {'unknown': 'a'}, inplace = True , errors = 'raise')

KeyError: "['unknown'] not found in axis"

## Rename column by adding prefix/suffix
- We can rename the DataFrame columns using DataFrame.add_prefix() and DataFrame.add_suffix() functions. It appends the input string as a prefix or suffix to the column names respectively.

- Note: These functions are only applicable to column labels and not row index of the DataFrame.

In [407]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [408]:
#adding prefix and suffix to column names

df1 = df.add_prefix('$_')
df1

  $_ name  $_ age   $_ marks
0    raju       30        99
1  kalyan       29        98
2   sunny        7        97

In [410]:
df2 = df.add_suffix('-$')
df2

   name-$   age -$   marks-$
0    raju       30        99
1  kalyan       29        98
2   sunny        7        97

## Rename column using DataFrame.set_axis()
- Use the set_axis() method you to rename all the index or column labels with a list. Using this function we can reassign column headers or row index of the DataFrame.

- This function is useful when working with a data set with no column names.

## Syntax:

- DataFrame.set_axis(labels, axis=0, inplace=False)
## Parameters:

- labels: List of column names as an input.
- axis: The axis to update. Set axis=1 rename column headers. The default value is 0. (i.e., rename row index)
- inplace: It is used to decide whether to return a new DataFrame instance or rename the existing one. It is a boolean flag with the default False. If it is True then it renames the existing DataFrame rather than creating a copy.
## Returns:

- It returns an object of type DataFrame else None if inplace=True.

- Note: Supply a list to the set_axis() method that is equal in length to the number of columns otherwise you will get an error.

In [416]:
my_dict = {' name': ['raju', 'kalyan', 'sunny'], ' age ': [30,29,7], ' marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name   age    marks
0    raju     30      99
1  kalyan     29      98
2   sunny      7      97

In [417]:
df.set_axis(['new_name', 'new_age', 'new_marks'], axis = 'columns', inplace = True)
df.columns.values

array(['new_name', 'new_age', 'new_marks'], dtype=object)

## Rename column in multi-index DataFrame
- Pandas DataFrame can have single or multiple rows as column labels, i.e., a header to identify the columns. DataFrame with multiple headers is called a multi-index DataFrame.

- Rename columns in all levels
- We can apply DataFrame.rename() function on multi-index DataFrame.

- In the below example, we use df.rename(columns={'old_col':'new_col'}) which rename the column labels in all the levels of multi-index DataFrame.

In [418]:
#create a column header

col = pd.MultiIndex.from_arrays([['Class A', 'Class A', 'Class B', 'Class B'], 
                                ['Name', 'Marks', 'Name', 'Marks']])

In [419]:
#create data frame from 2d Array

df = pd.DataFrame([['raju', 99, 'kalyan', 98], ['sunny', 97, 'bunny', 95]], columns = col)
df

  Class A       Class B
     Name Marks    Name Marks
0    raju    99  kalyan    98
1   sunny    97   bunny    95

In [420]:
#Rename col label
df = df.rename(columns = {'Name': 'SName'})
df

  Class A       Class B
    SName Marks   SName Marks
0    raju    99  kalyan    98
1   sunny    97   bunny    95

## Rename columns in defined level
- It is the case when we have the same column labels in multiple levels of the multi-index DataFrame. But, we need to rename the column in a selected level only. Or we want to rename column labels of a particular level only in such cases we can use the level parameter of DataFrame.rename().

- This parameter is used to specify the level name or level index where we need to rename the columns.

  Class A       Class B
    SName Marks   SName Marks
0    raju    99  kalyan    98
1   sunny    97   bunny    95

In [422]:
#create a column header

col = pd.MultiIndex.from_arrays([['Class A', 'Class A', 'Class B', 'Class B'], 
                                ['Name', 'Marks', 'Name', 'Marks']])

#create data frame from 2d Array

df = pd.DataFrame([['raju', 99, 'kalyan', 98], ['sunny', 97, 'bunny', 95]], columns = col)
df

  Class A       Class B
     Name Marks    Name Marks
0    raju    99  kalyan    98
1   sunny    97   bunny    95

In [423]:
df = df.rename(columns = str.upper, level = 1)
df

  Class A       Class B
     NAME MARKS    NAME MARKS
0    raju    99  kalyan    98
1   sunny    97   bunny    95

## Convert Pandas DataFrame to Python dictionary
- Data Analyst needs to collect the data from heterogeneous sources like CSV files or SQL tables or Python data structures like a dictionary, list, etc. Such data is converted into pandas DataFrame.

- After analyzing the data, we need to convert the resultant DataFrame back to its original format like CSV files or a dictionary. Or sometimes, we need to convert it into some other form.

## The DataFrame.to_dict() function
- Pandas have a DataFrame.to_dict() function to create a Python dict object from DataFrame.

- DataFrame.to_dict(orient='dict', into=<class 'dict'>)

## Parameters:

- into: It is used to define the type of resultant dict. We can give an actual class or an empty instance.
- orient: It defines the structure of key-value pairs in the resultant dict. The below table shows the input parameter, the format in which it creates the dict and key-value of the resultant dict.

In [426]:
import pandas as pd

# create dataframe from csv
df = pd.read_csv("StudentData.csv")
print(df)

# create dict from dataframe
df_Dict = df.to_dict()
print(df_Dict)

    Name  Marks
0    Nat  70.88
1  Harry  85.90
2    Joe  91.45
{'Name': {0: 'Nat', 1: 'Harry', 2: 'Joe'}, 'Marks': {0: 70.88, 1: 85.9, 2: 91.45}}

## DataFrame to dict with a list of values
- It is a case when we have DataFrame, which needs to be converted into the dictionary object such that column label should be the keys in the dictionary, and all the columns’ data should be added into the resultant dict as a list of values against each key.

In [428]:
df = pd.read_csv("StudentData.csv")
df

    Name  Marks
0    Nat  70.88
1  Harry  85.90
2    Joe  91.45

In [429]:
df_dict = df.to_dict('list')
df_dict

{'Name': ['Nat', 'Harry', 'Joe'], 'Marks': [70.88, 85.9, 91.45]}

## DataFrame to dict with pandas series of values
- When we need to convert the DataFrame into dict whereas column name as a key of the dict. And row index and data as a value in the dict for the respective keys.

- {column_label : Series(row_index data)}
- In that case, we can use the 'series' parameter of DataFrame.to_dict() function.

In [431]:
df_dict = df.to_dict('series')
print(df_dict)

{'Name': 0      Nat
1    Harry
2      Joe
Name: Name, dtype: object, 'Marks': 0    70.88
1    85.90
2    91.45
Name: Marks, dtype: float64}

## DataFrame to dict without header and index
- When we want to collect the data from DataFrame without the column headers or we need to separate the row index and header from the data, we can use the 'split' parameter of DataFrame.to_dict() function. It splits the input DataFrame into three parts, i.e., row index, column labels, and actual data.

- {'row_index' : [index], 'column_label' : [columns], 'data' : [data]}

In [432]:
df_dict = df.to_dict('split')
print(df_dict)

{'index': [0, 1, 2], 'columns': ['Name', 'Marks'], 'data': [['Nat', 70.88], ['Harry', 85.9], ['Joe', 91.45]]}

In [433]:
print(df_dict['data'])

[['Nat', 70.88], ['Harry', 85.9], ['Joe', 91.45]]

## DataFrame to dict by row

- When we have a DataFrame where each row contains data that needs to be store in a separate dictionary object, i.e., we need a data row-wise, we can use the 'records' parameter of the DataFrame.to_dict() function.

- It returns a list of dictionary objects. A dict for each row, where the key is a column label, and the value is column data.

- [{column_label : data}, … , {column_label : data}]

In [434]:
df_dict = df.to_dict('record')
print(df_dict)

[{'Name': 'Nat', 'Marks': 70.88}, {'Name': 'Harry', 'Marks': 85.9}, {'Name': 'Joe', 'Marks': 91.45}]

C:\Users\RAJU~1.GUL\AppData\Local\Temp/ipykernel_2072/3262765786.py:1: FutureWarning: Using short name for 'orient' is deprecated. Only the options: ('dict', list, 'series', 'split', 'records', 'index') will be used in a future version. Use one of the above to silence this warning.
  df_dict = df.to_dict('record')

## DataFrame to dict by row index
- When we have a DataFrame with row indexes and if we need to convert the data of each row from DataFrame to dict, we can use the index parameter of the DataFrame.to_dict() function.

- It returns a list of dictionary objects. A dict is created for each row. Where the key is a row index, and the value is dict of column label and data.

- {row_index : {column_label : data}}

In [435]:
df_dict = df.to_dict('index')
print(df_dict)

{0: {'Name': 'Nat', 'Marks': 70.88}, 1: {'Name': 'Harry', 'Marks': 85.9}, 2: {'Name': 'Joe', 'Marks': 91.45}}

## DataFrame to dict with one column as the key
- In this section, we target the use case when we need to create a dict from DataFrame where one column as a key of dict and other columns as the value of the dict.

- Suppose we have student DataFrame with two columns, student’s Name, and student’s Marks. And we need to store each student’s data in the dict where the student name is the Key and their marks as a Value of the dict.

- We can do it in various ways, as shown below.

- Using df.set_index('Col1').to_dict()['Col2']
- Using zip(df.Col1, df.Col2)
- Using df.set_index('Col1').T.to_dict('list')

In [436]:
df = pd.read_csv("StudentData.csv")
df

    Name  Marks
0    Nat  70.88
1  Harry  85.90
2    Joe  91.45

In [439]:
df.Name

0      Nat
1    Harry
2      Joe
Name: Name, dtype: object

In [440]:
df.Marks

0    70.88
1    85.90
2    91.45
Name: Marks, dtype: float64

In [437]:
#create a dict with Name as key and marks as values

df_dict = df.set_index('Name').to_dict()['Marks']
df_dict

{'Nat': 70.88, 'Harry': 85.9, 'Joe': 91.45}

In [438]:
#by using zip()

df_dict1 = dict(zip(df.Name, df.Marks))
df_dict1

{'Nat': 70.88, 'Harry': 85.9, 'Joe': 91.45}

- If we want to collect the column data into the list, it can be done by applying transpose operation on the DataFrame and then converting it into dict.

In [441]:
# create dict with Name as key and marks as value

df_dict = df.set_index('Name').T.to_dict('list')
df_dict

{'Nat': [70.88], 'Harry': [85.9], 'Joe': [91.45]}

## DataFrame to dict using into parameter
- While converting a DataFrame to dict if we need output dict to be of a particular type, we can use the parameter into of DataFrame.to_dict() function. We can specify the class name or the instance of the class for the resultant dict.

In [444]:
#In the below example, we converted DataFrame to the dict of type OrderedDict.
from collections import OrderedDict
df_dict = df.to_dict(into=OrderedDict)
df_dict

OrderedDict([('Name', OrderedDict([(0, 'Nat'), (1, 'Harry'), (2, 'Joe')])),
             ('Marks', OrderedDict([(0, 70.88), (1, 85.9), (2, 91.45)]))])

## Set index in pandas DataFrame

- DataFrame is the tabular structure in the Python pandas library. It represents each row and column by the label. Row label is called an index, whereas column label is called column index/header.

- By default, while creating DataFrame, Python pandas assign a range of numbers (starting at 0) as a row index. Row indexes are used to identify each row. We can set a new row index or replace the existing ones using DataFrame.set_index() function, which we discuss further in more detail.

## The DataFrame.set_index() function
- This function is used to re-assign a row label using the existing column of the DataFrame. It can assign one or multiple columns as a row index. Let’s see how to use DataFrame.set_index() function to set row index or replace existing.

- syntax

- DataFrame.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)


## Parameters

- keys: It takes a single or list of column labels to set as an index. It also takes a list of new labels as input.
- drop: It is a flag to specify if columns to be used as the new index should be deleted From DataFrame or not.
- By default value is True, i.e., assign the column as an index and delete it.
- append: It is a flag to specify whether to append columns to the existing index. By default, it is False, i.e., it replaces the current index rather than appending.
- inplace: It is used to specify whether to return a new DataFrame or update an existing one. It is a boolean flag with default False.
- verify_integrity: It is a boolean flag,
   -  If True, then it checks the new index for duplicates and throws ValueError.
   -  If False, then it defers the check until necessary.
- Note: Setting to False will improve the performance of this method.

## Return

- DataFrame with the changed row labels or None if inplace=True.

## Set index using a column
- How to set index in pandas DataFrame

## Create pandas DataFrame
We can create a DataFrame from a CSV file or dict.

## Identify the columns to set as index
- We can set a specific column or multiple columns as an index in pandas DataFrame. Create a list of column labels to be used to set an index.
- ['col_label1', 'col_label2'...]

## Use DataFrame.set_index() function
We need to pass the column or list of column labels as input to the DataFrame.set_index() function to set it as an index of DataFrame. By default, these new index columns are deleted from the DataFrame.
df = df.set_index(['col_label1', 'col_label2'…])

## Set the index in place
We can use the parameter inplace to set the index in the existing DataFrame rather than create a new copy.
df.set_index(inplace=True)

In [451]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [453]:
#set index using column name

df = df.set_index('name')
df

        age  marks
name
raju     30     99
kalyan   29     98
sunny     7     97

## Set index using a list
- As we have seen, we can pass column labels of the DataFrame to assign it as an index of the DataFrame. We can also give a list of labels which can be strings or numbers to DataFrame.set_index() function to set a new index in the DataFrame.

- First, we create a Python Index object from a list of labels and then pass it as input to the DataFrame.set_index() function.

In [454]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [455]:
index = pd.Index(['s1', 's2', 's3'])

df = df.set_index(index)
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

## Set index using multiple columns
- Python pandas have DataFrame with multiple columns or rows as an index, and they are also called multi-index DataFrame. If we want to set multiple columns as row labels, we can use DataFrame.set_index() function.

- Note: It throws KeyError for unknown column labels.

In [459]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [460]:
#set multi index

df = df.set_index(['name', 'marks'])
df

              age
name   marks
raju   99      30
kalyan 98      29
sunny  97       7

## Set multi-index using a list and column

- If there is a case where we want to create a two-level row index of the DataFrame, where one level is the new list of labels and another level is created from the existing column.

- We can use DataFrame.set_index() to set the multi-level index of pandas DataFrame using a combination of a new list and the existing column.

- We need to create a Python Index object from a list of new labels and pass that Index object and an existing column label as input to the DataFrame.set_index() function to create a two-level index.

In [461]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29,7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [463]:
index = pd.Index(['s1', 's2', 's3'])

df = df.set_index([index, 'name'])
df

           age  marks
   name
s1 raju     30     99
s2 kalyan   29     98
s3 sunny     7     97

## Set multi-index using two Python series

- When we want to replace the existing index with the multiple new series rather than the existing columns, we can create such a multi-index DataFrame by assigning new series using DataFrame.set_index() function.

In [464]:
student_dict = {'Name': ['Joe', 'Nat', 'Harry'], 'Age': [20, 21, 19], 'Marks': [85.10, 77.80, 91.54]}

# create DataFrame from dict
student_df = pd.DataFrame(student_dict)
print(student_df)

# set multi-index
s = pd.Series([1, 2, 3])
student_df = student_df.set_index([s, s ** 2])
print(student_df)

    Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
      Name  Age  Marks
1 1    Joe   20  85.10
2 4    Nat   21  77.80
3 9  Harry   19  91.54

In [465]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [466]:
#set multi index

s = pd.Series([1,2,3])
df1 = df.set_index([s, s*2])
print(df1)

       name  age  marks
1 2    raju   30     99
2 4  kalyan   29     98
3 6   sunny    7     97

## Set index using a Python range
- Suppose we need to set a sequence of numbers as an index of the DataFrame such that it should start at any number. For example, we want to assign a roll number to the student DataFrame beginning from 1.

- It is not feasible to pass all the numbers as a list to the DataFrame.set_index() function. In such a case, we can use the Python range() function.

- We can create pandas Index using range() function and pass it to the DataFrame.set_index() function.

In [467]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [468]:
df2 = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
print(df2)

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [471]:
#set index 
index = pd.Index(range(1,4,1))
df1 = df.set_index(index)
df1

     name  age  marks
1    raju   30     99
2  kalyan   29     98
3   sunny    7     97

## Set index but keep column
- By default, DataFrame.set_index() function takes column name as input which should be used as an index of the DataFrame. After setting the new index, it deletes the column which is used.

- If we do not want to delete such a column from DataFrame, then we need to use the drop parameter of DataFrame.set_index(). It is a boolean flag such that,

- If drop=True (default case), it deletes the column and uses it as an index.
- If drop=False, it does not delete the column and uses it as an index.

In [472]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [476]:
#set index keep column

df222 = df.set_index('name', drop = False)
df222

          name  age  marks
name
raju      raju   30     99
kalyan  kalyan   29     98
sunny    sunny    7     97

## Set index by keeping old index
- DataFrame.set_index() is used to set a new index to the DataFrame. It is also used to extend the existing DataFrame, i.e., we can update the index by append to the existing index.

- We need to use the append parameter of the DataFrame.set_index() function to append the new index to the existing one. By default, the value of append is False.

In [477]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [478]:
df2 = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df2

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [480]:
#set index by append

df22 = df2.set_index('name', append = True)
df22

           age  marks
   name
s1 raju     30     99
s2 kalyan   29     98
s3 sunny     7     97

## Set index in place
- In the above examples, whenever we executed DataFrame.set_index() operation, pandas created a new copy of DataFrame because the modification is not-in place.

- Specify inplace=True to set index in the existing DataFrame rather than creating a copy of it.

- If inplace=True then it updates the existing DataFrame and does not return anything.
- If inplace=False then it creates a new DataFrame with updated changes and returns it.
- Note: You don’t need to assign the result back to a variable as we are performing modifications in place.

In [481]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [482]:
#set index inplace

df.set_index('name', inplace = True)
df

        age  marks
name
raju     30     99
kalyan   29     98
sunny     7     97

## Set index using a column with duplicates
- As we have discussed, we need to pass a column name that needs to be used to set row index in the DataFrame.

- But, the column may contain duplicate values. By default, DataFrame.set_index() allows duplicate index. If we want to change this behavior, then we can use the verify_integrity parameter of DataFrame.set_index().

- If verify_integrity=True, then it checks the new index for duplicates and throws ValueError.
- If verify_integrity=False, then it defers the check until necessary.
- Note: Setting to False will improve the performance of this method.

In [485]:
my_dict = {'name': ['raju', 'kalyan', 'raju'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2    raju    7     97

In [486]:
#set index error case

df = df.set_index('name', verify_integrity=True)
df

ValueError: Index has duplicate keys: Index(['raju'], dtype='object', name='name')

## Set index by column number
- If we need to set single or multiple columns as an index of the DataFrame, but we do not know the column labels to pass to DataFrame.set_index() function. In such a case, we can use the columns parameter of the DataFrame to retrieve the column index position.

- We need to create a list of columns using column position df.columns[[0,1]] and pass it to the DataFrame.set_index() function.

In [492]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [493]:
#set index
cols = list(df.columns[[0,2]])
df = df.set_index(cols)
df

              age
name   marks
raju   99      30
kalyan 98      29
sunny  97       7

## Reset index in pandas DataFrame

- DataFrame is the tabular structure in the Python pandas library. It represents each row and column by the label. Row label is called an index, whereas column label is called column index/header.

- After performing manipulations and filtering on the large dataset, we finally get the precise DataFrame as required. But, it carries the index of the original dataset. In such a case, we need to reset the index of the DataFrame.

## The DataFrame.reset_index() function
- After dropping and filtering the rows, this function is used to reset the index of the resultant Python DataFrame. Let’s discuss how to use DataFrame.reset_index() function in detail.

- Syntax

## DataFrame.reset_index(level=None, drop=False, inplace=False, col_level=0, col_fill='')

## Parameters

- level: In multi-level DataFrame, it takes a level name or a position of Row index that needs to be reset. By default, it reset all levels in a row index.
- drop: It is a boolean flag,
- True – It does not add the current row index as a new column in DataFrame.
- False (Default) – It adds the current row index as a new column in DataFrame.
- inplace: It is used to specify whether to return a new DataFrame or update an existing one. It is a boolean flag with default False.
- col_level: In multi-level DataFrame, determines which column header level the current row index is inserted into. By default, it is inserted into the first level.
- col_fill: In multi-level DataFrame, if the column headers have multiple levels, it determines how the other levels are named.
- For example, if we have a DataFrame with the two-column headers at levels 0 and 1, and if we add the current index as column header at level 0, we can specify the column header at level 1.

## Returns

- DataFrame with the new index or None if inplace=True.

## Reset index without new column
- By default, DataFrame.reset_index() adds the current row index as a new ‘index’ column in DataFrame. If we do not want to add the new column, we can use the drop parameter.

- If drop=True then it does not add the new column of the current row index in the DataFrame.
- If drop=False, is the default behavior where it adds the new column of the current row index in the DataFrame.

In [494]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [495]:
#create data frame from dict

df = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [496]:
#reset index without new column


df = df.reset_index(drop = True)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

## Reset index in place
- In the above examples, whenever we executed reset index operation, pandas created a new copy of DataFrame because the modification is not-in place.

- Specify inplace=True to reset index in the existing DataFrame rather than creating a copy of it.

- If the inplace=True then it updates the existing DataFrame and does not return anything.
- If the inplace=False then it creates a new DataFrame with an updated index and returns it.
- Note: You don’t need to assign the result back to a variable as we are performing modifications in place.

In [497]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [498]:
#create data frame from dict

df = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [499]:
#reset index in place

df.reset_index(inplace = True)
df

  index    name  age  marks
0    s1    raju   30     99
1    s2  kalyan   29     98
2    s3   sunny    7     97

## Reset index starts from 1
- Suppose we have a huge dataset which we need to filter. After filtering the DataFrame, it still carries the original index. When we want to reset the index of the DataFrame such that the new index should start with 1, we can do that in two steps,

- Use DataFrame.reset_index() to reset the row index to start at o.
- Use the index parameter of the DataFrame to re-assign the index by adding 1 to each row index of the resultant DataFrame.

In [500]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df

     name  age  marks
0    raju   30     99
1  kalyan   29     98
2   sunny    7     97

In [506]:
#create data frame from dict

df = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [507]:
#reset index

df = df.reset_index()
df

  index    name  age  marks
0    s1    raju   30     99
1    s2  kalyan   29     98
2    s3   sunny    7     97

In [508]:
#add 1 to each index

df.index = df.index+1
df

  index    name  age  marks
1    s1    raju   30     99
2    s2  kalyan   29     98
3    s3   sunny    7     97

## Reset index to the range of numbers
- In our student DataFrame, suppose we want to assign the Identity number to each student starting from 101. We can use the index parameter of DataFrame to change the index as a range of numbers that begins at a specific number.

- First, we need to generate the range of numbers and then assign it to the DataFrame.index to reset the original index.

In [509]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df
#create data frame from dict

df = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [510]:
#assign new index from 1 to n

df.index = pd.RangeIndex(start = 101, stop = 101+len(df), step =1)
df

       name  age  marks
101    raju   30     99
102  kalyan   29     98
103   sunny    7     97

## Reset index and change column name
- As we have already discussed, DataFrame.reset_index() adds the current index as a new column with the name ‘index’ in the DataFrame. If we want to give a name to such a newly added column, then we need to use DataFrame.rename() function with DataFrame.reset_index().

- Example

- Let’s see how to do the method chaining of DataFrame.reset_index() and DataFrame.rename() functions to rename a new ‘index’ column to ‘ID’.

In [511]:
my_dict = {'name': ['raju', 'kalyan', 'sunny'], 'age': [30,29, 7], 'marks': [99,98,97]}
df = pd.DataFrame(my_dict)
df
#create data frame from dict

df = pd.DataFrame(my_dict, index = ['s1', 's2', 's3'])
df

      name  age  marks
s1    raju   30     99
s2  kalyan   29     98
s3   sunny    7     97

In [512]:
#reset index and rename

df = df.reset_index().rename(columns={'index': 'ID'})
df

   ID    name  age  marks
0  s1    raju   30     99
1  s2  kalyan   29     98
2  s3   sunny    7     97

## Reset multi-level index
- When Python pandas DataFrame has multiple row index or column headers, then are called multi-level or hierarchical DataFrame. We can apply DataFrame.reset index() on such multi-index DataFrame.

In [516]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'),
                                   ('Standard 1', 'Class B'),
                                   ('Standard 2', 'Class A'),
                                   ('Standard 2', 'Class B')],
                                  names=['Standard', 'Class'])
columns = pd.MultiIndex.from_tuples([('Name', 'Surname'),
                                     ('Marks', 'Percentage')])

# create multi-index dataframe
student_df = pd.DataFrame([('Joe', 91.56),
                           ('Nat', 87.90),
                           ('Harry', 70.10),
                           ('Sam', 65.48)],
                          index=index, columns=columns)
print(student_df)

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A     Joe      91.56
           Class B     Nat      87.90
Standard 2 Class A   Harry      70.10
           Class B     Sam      65.48

- Now we see how to reset the index of the multi-level DataFrame using DataFrame.reset index(). By default, it reset the index of all the levels and add the new range of indexes in the DataFrame.

In [514]:
# reset multi-level index
student_df = student_df.reset_index()
print(student_df)

     Standard    Class    Name      Marks
                       Surname Percentage
0  Standard 1  Class A     Joe      91.56
1  Standard 1  Class B     Nat      87.90
2  Standard 2  Class A   Harry      70.10
3  Standard 2  Class B     Sam      65.48

## Reset index by level
- As we have seen, in the case of a multi-level index, by default DataFrame.reset_index() applies to the index of all the levels. If we want to reset the index of the specific level only then, we can use the level parameter of the DataFrame.reset_index() function.

- It takes a level position or level name as input to reset that particular index only.

In [518]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'),
                                   ('Standard 1', 'Class B'),
                                   ('Standard 2', 'Class A'),
                                   ('Standard 2', 'Class B')],
                                  names=['Standard', 'Class'])
columns = pd.MultiIndex.from_tuples([('Name', 'Surname'),
                                     ('Marks', 'Percentage')])

# create multi-index dataframe
student_df = pd.DataFrame([('Joe', 91.56),
                           ('Nat', 87.90),
                           ('Harry', 70.10),
                           ('Sam', 65.48)],
                          index=index, columns=columns)
print(student_df)

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A     Joe      91.56
           Class B     Nat      87.90
Standard 2 Class A   Harry      70.10
           Class B     Sam      65.48

In [517]:
# reset multi-level index by level
student_df = student_df.reset_index(level='Standard')
print(student_df)

           Standard    Name      Marks
                    Surname Percentage
Class
Class A  Standard 1     Joe      91.56
Class B  Standard 1     Nat      87.90
Class A  Standard 2   Harry      70.10
Class B  Standard 2     Sam      65.48

## Reset index and creates new column in level
- As we have observed in the above section, by default, DataFrame.reset_index() all the new column at the first level, i.e., level 0. If we want to add the new index column to other levels, we can use the col_level parameter.

- It takes the level name or level position as an input if the columns have multiple levels, so it determines which level the labels are inserted into.

In [519]:
# reset multi-level index and add at level 1
student_df = student_df.reset_index(level='Standard', col_level=1)
print(student_df)

                       Name      Marks
           Standard Surname Percentage
Class
Class A  Standard 1     Joe      91.56
Class B  Standard 1     Nat      87.90
Class A  Standard 2   Harry      70.10
Class B  Standard 2     Sam      65.48

## Reset index and name other level
- As we see in the above section, in multi-level DataFrame, we have added the ‘Standard’ index at level 1. If there is a case when we need to rename the other level, we need to use the col_fill parameter of DataFrame.

- We can specify any existing column label under which the new column will be assigned. If we specify the new label, then it will create one.

- Example

- In the below example, we create a new column from the index ‘Standard’ at level 1 and assign a new column label ‘New_Header’ at level 0 of this new column.

In [521]:
import pandas as pd

index = pd.MultiIndex.from_tuples([('Standard 1', 'Class A'),
                                   ('Standard 1', 'Class B'),
                                   ('Standard 2', 'Class A'),
                                   ('Standard 2', 'Class B')],
                                  names=['Standard', 'Class'])
columns = pd.MultiIndex.from_tuples([('Name', 'Surname'),
                                     ('Marks', 'Percentage')])

# create multi-index dataframe
student_df = pd.DataFrame([('Joe', 91.56),
                           ('Nat', 87.90),
                           ('Harry', 70.10),
                           ('Sam', 65.48)],
                          index=index, columns=columns)
print(student_df)

                      Name      Marks
                   Surname Percentage
Standard   Class
Standard 1 Class A     Joe      91.56
           Class B     Nat      87.90
Standard 2 Class A   Harry      70.10
           Class B     Sam      65.48

In [522]:
# reset multi-level index
student_df = student_df.reset_index(level='Standard', col_level=1, col_fill='New_Header')
print(student_df)

         New_Header    Name      Marks
           Standard Surname Percentage
Class
Class A  Standard 1     Joe      91.56
Class B  Standard 1     Nat      87.90
Class A  Standard 2   Harry      70.10
Class B  Standard 2     Sam      65.48

## 1. Pandas groupby() Syntax
- Below is the syntax of the groupby() function, this function takes several params that are explained below and returns DataFrameGroupBy object that contains information about the groups.


## Syntax of DataFrame.groupby()
- DataFrame.groupby(by=None, axis=0, level=None, as_index=True, 
       sort=True, group_keys=True, squeeze=<no_default>, 
       observed=False, dropna=True)

- by – List of column names to group by
- axis – Default to 0. It takes 0 or ‘index’, 1 or ‘columns’
- level – Used with MultiIndex.
- as_index – sql style grouped otput.
- sort – Default to True. Specify whether to sort after group
- group_keys – add group keys or not
- squeeze – depricated in new versions
- observed – This only applies if any of the groupers are Categoricals.
- dropna – Default to False. Use True to drop None/Nan on sory keys

In [532]:
import pandas as pd
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

## pandas groupby() Example
- As I said above groupby() function returns DataFrameGroupBy object after grouping the data on pandas DataFrame. This object contains several methods (sum(), mean() e.t.c) that can be used to aggregate the grouped rows

In [533]:
#use groupby to compute the sum

df2 = df.groupby(['Courses']).sum()
df2

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0

In [531]:
df2 = df.groupby(['Courses']).sum().max()
df2

Fee         48000.0
Discount     2800.0
dtype: float64

## pandas groupby() on Two or More Columns
- Most of the time we would need to perform groupby on multiple columns of DataFrame, you can do this by passing a list of column labels you wanted to perform group by on.

In [527]:
df2 = df.groupby(['Courses', 'Duration']).sum()
df2

                    Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days    24000    1200.0
        50days    22000    1600.0
Spark   30days    47000    2400.0

## Add Index to the grouped data
- By default groupby() result doesn’t include row Index, you can add the index using DataFrame.reset_index() method.

In [536]:
#Add Row Index to the group y result
df2 = df.groupby(['Courses', 'Duration']).sum().reset_index()
df2

   Courses Duration    Fee  Discount
0   Hadoop   35days  25000       0.0
1   Hadoop   55days  23000    1000.0
2       NA   40days   1500       0.0
3   Pandas   60days  26000    2500.0
4  PySpark   50days  25000    2300.0
5   Python   40days  24000    1200.0
6   Python   50days  22000    1600.0
7    Spark   30days  47000    2400.0

## Drop NA /None/Nan (on group key) from Result
- You can also choose whether to include NA/None/Nan in group keys or not by setting dropna parameter. By default the value of dropna set to True. so to not to include None/Nan values on group keys set dropna=False parameter.

In [538]:
#drop rows that have None/Nan on group keys
df2 = df.groupby(by = ['Courses'], dropna = False).sum()
df2

           Fee  Discount
Courses
Hadoop   48000    1000.0
NA        1500       0.0
Pandas   26000    2500.0
PySpark  25000    2300.0
Python   46000    2800.0
Spark    47000    2400.0